{"\"{0}\" has fingerprint \"{1}\".":"\"{0}\" hæs fïñgërprïñt \"{1}\".","'{0}' will be executed on your local machine.":"'{0}' wïll þë ëxëçµtëð øñ ÿøµr løçæl mæçhïñë.","A VS Code Server matching your local installation could not be downloaded from the internet.":"Æ V§ Çøðë §ërvër mætçhïñg ÿøµr løçæl ïñstællætïøñ çøµlð ñøt þë ðøwñløæðëð frøm thë ïñtërñët.","A command required on the remote machine was not found":"Æ çømmæñð rëqµïrëð øñ thë rëmøtë mæçhïñë wæs ñøt føµñð","Add the setting '{0}' to the server's '{1}' (or similar) configuration file":"Æðð thë sëttïñg '{0}' tø thë sërvër's '{1}' (ør sïmïlær) çøñfïgµrætïøñ fïlë","After logging into Copilot Chat, return here to continue diagnosing your connection issue.":"Æftër løggïñg ïñtø Çøpïløt Çhæt, rëtµrñ hërë tø çøñtïñµë ðïægñøsïñg ÿøµr çøññëçtïøñ ïssµë.","Allow":"Ælløw","Allow and Don't Ask Again":"Ælløw æñð Ðøñ't Æsk Ægæïñ","An SSH installation couldn't be found":"Æñ §§H ïñstællætïøñ çøµlðñ't þë føµñð","An error occurred while parsing the local SSH configuration file":"Æñ ërrør øççµrrëð whïlë pærsïñg thë løçæl §§H çøñfïgµrætïøñ fïlë","Analyzing your previous SSH session logs...":"Æñælÿzïñg ÿøµr prëvïøµs §§H sëssïøñ løgs...","Are you sure you want to continue connecting?":"Ærë ÿøµ sµrë ÿøµ wæñt tø çøñtïñµë çøññëçtïñg?","Are you sure you want to continue?":"Ærë ÿøµ sµrë ÿøµ wæñt tø çøñtïñµë?","Can't assign requested address":"Çæñ't æssïgñ rëqµëstëð æððrëss","Cancel":"Çæñçël","Change value of setting {0} to '{1}'":"Çhæñgë vælµë øf sëttïñg {0} tø '{1}'","Chat with {0}":"Çhæt wïth {0}","Check proxy settings on local machine":"Çhëçk prøxÿ sëttïñgs øñ løçæl mæçhïñë","Check the Remote - SSH log for output from the script (prefixed with {0})":"Çhëçk thë Rëmøtë - §§H løg før øµtpµt frøm thë sçrïpt (prëfïxëð wïth {0})","Checking VS Code Server status failed - please install either curl or wget on the remote.":"Çhëçkïñg V§ Çøðë §ërvër stætµs fæïlëð - plëæsë ïñstæll ëïthër çµrl ør wgët øñ thë rëmøtë.","Client-side server download failed":"Çlïëñt-sïðë sërvër ðøwñløæð fæïlëð","Close Remote":"Çløsë Rëmøtë","Config file to save in":"Çøñfïg fïlë tø sævë ïñ","Configure SSH Hosts...":"Çøñfïgµrë §§H Høsts...","Connect":"Çøññëçt","Connect to VS Code Server - retry {0}":"Çøññëçt tø V§ Çøðë §ërvër - rëtrÿ {0}","Connecting was canceled":"Çøññëçtïñg wæs çæñçëlëð","Continue":"Çøñtïñµë","Copying VS Code Server to host with scp":"Çøpÿïñg V§ Çøðë §ërvër tø høst wïth sçp","Could not establish connection to \"{0}\"":"Çøµlð ñøt ëstæþlïsh çøññëçtïøñ tø \"{0}\"","Could not establish connection to \"{0}\": {1}":"Çøµlð ñøt ëstæþlïsh çøññëçtïøñ tø \"{0}\": {1}","Could not resolve hostname":"Çøµlð ñøt rësølvë høstñæmë","Delete the setting for this host to use the default path in the user home directory":"Ðëlëtë thë sëttïñg før thïs høst tø µsë thë ðëfæµlt pæth ïñ thë µsër hømë ðïrëçtørÿ","Detected Windows host, need to reconnect":"Ðëtëçtëð Wïñðøws høst, ñëëð tø rëçøññëçt","Diagnose with Copilot":"Ðïægñøsë wïth Çøpïløt","Disable {0}":"Ðïsæþlë {0}","Discuss Remote - SSH related topics and diagnose connection issues with Copilot.  Recent connection logs will be shared with Copilot as chat context.":"Ðïsçµss Rëmøtë - §§H rëlætëð tøpïçs æñð ðïægñøsë çøññëçtïøñ ïssµës wïth Çøpïløt.  Rëçëñt çøññëçtïøñ løgs wïll þë shærëð wïth Çøpïløt æs çhæt çøñtëxt.","Do not use variables, double quotes, or other non-path characters when setting {0}":"Ðø ñøt µsë værïæþlës, ðøµþlë qµøtës, ør øthër ñøñ-pæth çhæræçtërs whëñ sëttïñg {0}","Don't Show Again":"Ðøñ't §høw Ægæïñ","Download the correct VS Code that corresponds both to your local installation and the remote architecture":"Ðøwñløæð thë çørrëçt V§ Çøðë thæt çørrëspøñðs þøth tø ÿøµr løçæl ïñstællætïøñ æñð thë rëmøtë ærçhïtëçtµrë","Downloading VS Code Server":"Ðøwñløæðïñg V§ Çøðë §ërvër","Downloading VS Code Server failed - please install either curl or wget on the remote.":"Ðøwñløæðïñg V§ Çøðë §ërvër fæïlëð - plëæsë ïñstæll ëïthër çµrl ør wgët øñ thë rëmøtë.","Downloading VS Code Server failed. Please try again later.":"Ðøwñløæðïñg V§ Çøðë §ërvër fæïlëð. Plëæsë trÿ ægæïñ lætër.","Downloading VS Code Server locally":"Ðøwñløæðïñg V§ Çøðë §ërvër løçællÿ","Downloading VS Code Server...":"Ðøwñløæðïñg V§ Çøðë §ërvër...","ERROR: TCP port forwarding appears to be disabled on the remote host. Ensure that the sshd_config has `AllowTcpForwarding yes`. Contact your system administrator if needed.":"ËRRØR: TÇP pørt førwærðïñg æppëærs tø þë ðïsæþlëð øñ thë rëmøtë høst. Ëñsµrë thæt thë sshð_çøñfïg hæs `ÆlløwTçpFørwærðïñg ÿës`. Çøñtæçt ÿøµr sÿstëm æðmïñïstrætør ïf ñëëðëð.","Edit custom SSH configuration file":"Ëðït çµstøm §§H çøñfïgµrætïøñ fïlë","Edit setting {0} to an absolute path on the remote server":"Ëðït sëttïñg {0} tø æñ æþsølµtë pæth øñ thë rëmøtë sërvër","Enable {0} to allow VS Code to download the required resources locally":"Ëñæþlë {0} tø ælløw V§ Çøðë tø ðøwñløæð thë rëqµïrëð rësøµrçës løçællÿ","Enable {0} to allow VS Code to download the required resources via your local machine and then upload them to the remote server":"Ëñæþlë {0} tø ælløw V§ Çøðë tø ðøwñløæð thë rëqµïrëð rësøµrçës vïæ ÿøµr løçæl mæçhïñë æñð thëñ µpløæð thëm tø thë rëmøtë sërvër","Ensure '{0}' operates between local and remote machines":"Ëñsµrë '{0}' øpërætës þëtwëëñ løçæl æñð rëmøtë mæçhïñës","Ensure curl/wget are on the remote system's '{0}'":"Ëñsµrë çµrl/wgët ærë øñ thë rëmøtë sÿstëm's '{0}'","Ensure that the parent directory exists":"Ëñsµrë thæt thë pærëñt ðïrëçtørÿ ëxïsts","Ensure that the remote server has internet access and has access to the VS Code CDN":"Ëñsµrë thæt thë rëmøtë sërvër hæs ïñtërñët æççëss æñð hæs æççëss tø thë V§ Çøðë ÇÐÑ","Ensure that the remote server has internet access and that the network is not blocking the download":"Ëñsµrë thæt thë rëmøtë sërvër hæs ïñtërñët æççëss æñð thæt thë ñëtwørk ïs ñøt þløçkïñg thë ðøwñløæð","Ensure that the remote user has write permissions to the parent directory":"Ëñsµrë thæt thë rëmøtë µsër hæs wrïtë përmïssïøñs tø thë pærëñt ðïrëçtørÿ","Ensure that the {0} setting correctly reflects the remote platform. Ensure no wildcard entry is being selected erroneously":"Ëñsµrë thæt thë {0} sëttïñg çørrëçtlÿ rëflëçts thë rëmøtë plætførm. Ëñsµrë ñø wïlðçærð ëñtrÿ ïs þëïñg sëlëçtëð ërrøñëøµslÿ","Ensure the provide path is an absolute path":"Ëñsµrë thë prøvïðë pæth ïs æñ æþsølµtë pæth","Ensure the provided path is executable and the script exits successfully (exit code 0)":"Ëñsµrë thë prøvïðëð pæth ïs ëxëçµtæþlë æñð thë sçrïpt ëxïts sµççëssfµllÿ (ëxït çøðë 0)","Ensure the remote machine is configured to receive incoming connections on the local network":"Ëñsµrë thë rëmøtë mæçhïñë ïs çøñfïgµrëð tø rëçëïvë ïñçømïñg çøññëçtïøñs øñ thë løçæl ñëtwørk","Ensure there is sufficient free disk space on the remote machine":"Ëñsµrë thërë ïs sµffïçïëñt frëë ðïsk spæçë øñ thë rëmøtë mæçhïñë","Ensure this program is installed on the remote machine and accessible via the '{0}' environment variable":"Ëñsµrë thïs prøgræm ïs ïñstællëð øñ thë rëmøtë mæçhïñë æñð æççëssïþlë vïæ thë '{0}' ëñvïrøñmëñt værïæþlë","Enter SSH Connection Command":"Ëñtër §§H Çøññëçtïøñ Çømmæñð","Enter passphrase for ssh key {0}":"Ëñtër pæssphræsë før ssh këÿ {0}","Enter password":"Ëñtër pæsswørð","Enter password for {0}":"Ëñtër pæsswørð før {0}","Error establishing tunnel ({0}).":"Ërrør ëstæþlïshïñg tµññël ({0}).","Execute pre-connection script?":"Ëxëçµtë prë-çøññëçtïøñ sçrïpt?","Expected tarball at local path {0}":"Ëxpëçtëð tærþæll æt løçæl pæth {0}","Failed to create the remote server's install directory":"Fæïlëð tø çrëætë thë rëmøtë sërvër's ïñstæll ðïrëçtørÿ","Failed to download VS Code Server ({0})":"Fæïlëð tø ðøwñløæð V§ Çøðë §ërvër ({0})","Failed to download VS Code Server locally":"Fæïlëð tø ðøwñløæð V§ Çøðë §ërvër løçællÿ","Failed to find a free local port: {0}":"Fæïlëð tø fïñð æ frëë løçæl pørt: {0}","Failed to find a non-Windows SSH installed. Password prompts may not be displayed properly! Disable `remote.SSH.useLocalServer` if needed./{Locked=\"`remote.SSH.useLocalServer`\"}Do not translate `remote.SSH.useLocalServer`, it is a VS Code command.":"Fæïlëð tø fïñð æ ñøñ-Wïñðøws §§H ïñstællëð. Pæsswørð prømpts mæÿ ñøt þë ðïsplæÿëð prøpërlÿ! Ðïsæþlë `remote.SSH.useLocalServer` ïf ñëëðëð.","Failed to install the VS Code Server":"Fæïlëð tø ïñstæll thë V§ Çøðë §ërvër","Failed to kill VS Code Server on {0}.":"Fæïlëð tø kïll V§ Çøðë §ërvër øñ {0}.","Help":"Hëlp","Host added!":"Høst æððëð!","Hostname contains invalid characters":"Høstñæmë çøñtæïñs ïñvælïð çhæræçtërs","If your remote server is behind a firewall, ask your IT department to allow access to the VS Code CDN":"Ïf ÿøµr rëmøtë sërvër ïs þëhïñð æ fïrëwæll, æsk ÿøµr ÏT ðëpærtmëñt tø ælløw æççëss tø thë V§ Çøðë ÇÐÑ","If your remote server is behind a proxy, provide the proxy URL with setting '{0}' or '{1}'":"Ïf ÿøµr rëmøtë sërvër ïs þëhïñð æ prøxÿ, prøvïðë thë prøxÿ ÜR£ wïth sëttïñg '{0}' ør '{1}'","Initializing VS Code Server":"Ïñïtïælïzïñg V§ Çøðë §ërvër","Install '{0}' on the remote server. Installation steps will vary per distribution.":"Ïñstæll '{0}' øñ thë rëmøtë sërvër. Ïñstællætïøñ stëps wïll værÿ për ðïstrïþµtïøñ.","Installing VS Code Server":"Ïñstællïñg V§ Çøðë §ërvër","Killed VS Code Server on {0}.":"Kïllëð V§ Çøðë §ërvër øñ {0}.","Learn More":"£ëærñ Mørë","Local bootstrap of the VS Code Server failed.  This is an advanced feature for use in environments with limited internet acccess.":"£øçæl þøøtstræp øf thë V§ Çøðë §ërvër fæïlëð.  Thïs ïs æñ æðvæñçëð fëætµrë før µsë ïñ ëñvïrøñmëñts wïth lïmïtëð ïñtërñët æçççëss.","Local download mode is configured as 'manual-bootstrap'. Exec server mode will be disabled.'":"£øçæl ðøwñløæð møðë ïs çøñfïgµrëð æs 'mæñµæl-þøøtstræp'. Ëxëç sërvër møðë wïll þë ðïsæþlëð.'","Max wait time exhausted":"Mæx wæït tïmë ëxhæµstëð","Message":"Mëssægë","Mitigations":"Mïtïgætïøñs","More Actions...":"Mørë Æçtïøñs...","More Info":"Mørë Ïñfø","Network is unreachable":"Ñëtwørk ïs µñrëæçhæþlë","No free ports in specified range '{0}-{1}'.  Remove or update the 'Preferred Local Port Range' setting and try again.":"Ñø frëë pørts ïñ spëçïfïëð ræñgë '{0}-{1}'.  Rëmøvë ør µpðætë thë 'Prëfërrëð £øçæl Pørt Ræñgë' sëttïñg æñð trÿ ægæïñ.","No route found to remote machine with a local IPv4 address.":"Ñø røµtë føµñð tø rëmøtë mæçhïñë wïth æ løçæl ÏPv4 æððrëss.","No route to host":"Ñø røµtë tø høst","On Mac OS, grant VS Code the 'Local Network' permission in System Settings":"Øñ Mæç Ø§, græñt V§ Çøðë thë '£øçæl Ñëtwørk' përmïssïøñ ïñ §ÿstëm §ëttïñgs","Open Config":"Øpëñ Çøñfïg","Open Documentation":"Øpëñ Ðøçµmëñtætïøñ","Open Logs":"Øpëñ £øgs","Open Recent...":"Øpëñ Rëçëñt...","Open SSH Configuration File":"Øpëñ §§H Çøñfïgµrætïøñ Fïlë","Open Settings":"Øpëñ §ëttïñgs","Pick an action to help resolve the problem.":"Pïçk æñ æçtïøñ tø hëlp rësølvë thë prøþlëm.","Place the VS Code Server in the bootstrap location specified in settings":"Plæçë thë V§ Çøðë §ërvër ïñ thë þøøtstræp løçætïøñ spëçïfïëð ïñ sëttïñgs","Port forwarding is disabled":"Pørt førwærðïñg ïs ðïsæþlëð","Pre-connection script has changed since last confirmation":"Prë-çøññëçtïøñ sçrïpt hæs çhæñgëð sïñçë læst çøñfïrmætïøñ","Proxy URL in settings is invalid":"Prøxÿ ÜR£ ïñ sëttïñgs ïs ïñvælïð","Received 407 from the server":"Rëçëïvëð 407 frøm thë sërvër","Remote host key has changed, port forwarding is disabled":"Rëmøtë høst këÿ hæs çhæñgëð, pørt førwærðïñg ïs ðïsæþlëð","Remove or edit setting {0}":"Rëmøvë ør ëðït sëttïñg {0}","Remove this value from settings or correct the URL":"Rëmøvë thïs vælµë frøm sëttïñgs ør çørrëçt thë ÜR£","Report this issue with an example configuration file":"Rëpørt thïs ïssµë wïth æñ ëxæmplë çøñfïgµrætïøñ fïlë","Resources":"Rësøµrçës","Restart the SSH server on the remote machine to apply any changes to the configuration":"Rëstært thë §§H sërvër øñ thë rëmøtë mæçhïñë tø æpplÿ æñÿ çhæñgës tø thë çøñfïgµrætïøñ","Retry":"Rëtrÿ","Running pre-connection script ({0})":"Rµññïñg prë-çøññëçtïøñ sçrïpt ({0})","SSH host name cannot begin with {0}":"§§H høst ñæmë çæññøt þëgïñ wïth {0}","SSH host name cannot include the character {0}":"§§H høst ñæmë çæññøt ïñçlµðë thë çhæræçtër {0}","SSH user name cannot begin with {0}":"§§H µsër ñæmë çæññøt þëgïñ wïth {0}","SSH user name cannot include the character {0}":"§§H µsër ñæmë çæññøt ïñçlµðë thë çhæræçtër {0}","Search '{0}' in settings":"§ëærçh '{0}' ïñ sëttïñgs","See output log for server installation URL":"§ëë øµtpµt løg før sërvër ïñstællætïøñ ÜR£","See verbose information in the":"§ëë vërþøsë ïñførmætïøñ ïñ thë","Select SSH configuration file to update":"§ëlëçt §§H çøñfïgµrætïøñ fïlë tø µpðætë","Select configured SSH host or enter user@host/Translate user@host such that both user and host are translated but joined by an \"@\" sign.":"§ëlëçt çøñfïgµrëð §§H høst ør ëñtër µsër@høst","Set '{0}' in VS Code settings to use the correct proxy":"§ët '{0}' ïñ V§ Çøðë sëttïñgs tø µsë thë çørrëçt prøxÿ","Setting up SSH Host {0}":"§ëttïñg µp §§H Høst {0}","Setting up SSH tunnel":"§ëttïñg µp §§H tµññël","Settings":"§ëttïñgs","Show details in terminal":"§høw ðëtæïls ïñ tërmïñæl","Skip":"§kïp","Status":"§tætµs","The VS Code Server failed to start":"Thë V§ Çøðë §ërvër fæïlëð tø stært","The VS Code Server terminated due to presence of CVE-2020-1416. Check the Remote-SSH output channel for more details.":"Thë V§ Çøðë §ërvër tërmïñætëð ðµë tø prësëñçë øf ÇVË-2020-1416. Çhëçk thë Rëmøtë-§§H øµtpµt çhæññël før mørë ðëtæïls.","The connection timed out":"Thë çøññëçtïøñ tïmëð øµt","The following issues were detected in your most recent Remote - SSH session":"Thë følløwïñg ïssµës wërë ðëtëçtëð ïñ ÿøµr møst rëçëñt Rëmøtë - §§H sëssïøñ","The install directory on the remote host could not be created. By default this is the '{0}' directory and can be overridden with the setting {1}":"Thë ïñstæll ðïrëçtørÿ øñ thë rëmøtë høst çøµlð ñøt þë çrëætëð. ßÿ ðëfæµlt thïs ïs thë '{0}' ðïrëçtørÿ æñð çæñ þë øvërrïððëñ wïth thë sëttïñg {1}","The operation timed out":"Thë øpërætïøñ tïmëð øµt","The pre-connect script has failed":"Thë prë-çøññëçt sçrïpt hæs fæïlëð","The process tried to write to a nonexistent pipe":"Thë prøçëss trïëð tø wrïtë tø æ ñøñëxïstëñt pïpë","The provided custom server path is invalid":"Thë prøvïðëð çµstøm sërvër pæth ïs ïñvælïð","The remote host does not meet the prerequisites for running VS Code Server":"Thë rëmøtë høst ðøës ñøt mëët thë prërëqµïsïtës før rµññïñg V§ Çøðë §ërvër","The remote host may not meet VS Code Server's prerequisites for glibc and libstdc++":"Thë rëmøtë høst mæÿ ñøt mëët V§ Çøðë §ërvër's prërëqµïsïtës før glïþç æñð lïþstðç++","The remote host's architecture is not supported":"Thë rëmøtë høst's ærçhïtëçtµrë ïs ñøt sµppørtëð","The remote host's architecture is only supported on VS Code Insiders":"Thë rëmøtë høst's ærçhïtëçtµrë ïs øñlÿ sµppørtëð øñ V§ Çøðë Ïñsïðërs","The remote host's platform is not supported":"Thë rëmøtë høst's plætførm ïs ñøt sµppørtëð","The remote server has terminated the connection due to a known and preventable security vulnerability":"Thë rëmøtë sërvër hæs tërmïñætëð thë çøññëçtïøñ ðµë tø æ kñøwñ æñð prëvëñtæþlë sëçµrïtÿ vµlñëræþïlïtÿ","The remote server's SSH configuration may have TCP forwarding disabled":"Thë rëmøtë sërvër's §§H çøñfïgµrætïøñ mæÿ hævë TÇP førwærðïñg ðïsæþlëð","URL must include the scheme ({0} or {1})":"ÜR£ mµst ïñçlµðë thë sçhëmë ({0} ør {1})","URL should not contain non-URL characters":"ÜR£ shøµlð ñøt çøñtæïñ ñøñ-ÜR£ çhæræçtërs","Unsupported script type. Provide a .ps1 script on Windows.":"Üñsµppørtëð sçrïpt tÿpë. Prøvïðë æ .ps1 sçrïpt øñ Wïñðøws.","Update VS Code and try again later":"Üpðætë V§ Çøðë æñð trÿ ægæïñ lætër","Update the remote.SSH.preconnect setting":"Üpðætë thë rëmøtë.§§H.prëçøññëçt sëttïñg","View the Output Log to see mitigation steps provided by the VS Code Server":"Vïëw thë Øµtpµt £øg tø sëë mïtïgætïøñ stëps prøvïðëð þÿ thë V§ Çøðë §ërvër","Waiting for other windows to connect":"Wæïtïñg før øthër wïñðøws tø çøññëçt","Waiting for port forwarding to be ready":"Wæïtïñg før pørt førwærðïñg tø þë rëæðÿ","When first establishing a connection to the remote server, various resources must be installed from the internet. A program (either \"wget\" or \"curl\") is used to download these resources, but they are not installed on the remote server.  When this step fails, the extension attempts to use the local machine to download the resources and then upload them to the remote server.":"Whëñ fïrst ëstæþlïshïñg æ çøññëçtïøñ tø thë rëmøtë sërvër, værïøµs rësøµrçës mµst þë ïñstællëð frøm thë ïñtërñët. Æ prøgræm (ëïthër \"wgët\" ør \"çµrl\") ïs µsëð tø ðøwñløæð thësë rësøµrçës, þµt thëÿ ærë ñøt ïñstællëð øñ thë rëmøtë sërvër.  Whëñ thïs stëp fæïls, thë ëxtëñsïøñ ættëmpts tø µsë thë løçæl mæçhïñë tø ðøwñløæð thë rësøµrçës æñð thëñ µpløæð thëm tø thë rëmøtë sërvër.","Windows hosts are only supported on VS Code Insiders":"Wïñðøws høsts ærë øñlÿ sµppørtëð øñ V§ Çøðë Ïñsïðërs","Windows remotes do not support local bootstrap":"Wïñðøws rëmøtës ðø ñøt sµppørt løçæl þøøtstræp","about SSH configuration files":"æþøµt §§H çøñfïgµrætïøñ fïlës","bash not found":"þæsh ñøt føµñð","click on an issue to continue in Copilot Chat.":"çlïçk øñ æñ ïssµë tø çøñtïñµë ïñ Çøpïløt Çhæt.","https://aka.ms/vscode-remote/faq/old-linux":"https://ækæ.ms/vsçøðë-rëmøtë/fæq/ølð-lïñµx","specify a custom configuration file":"spëçïfÿ æ çµstøm çøñfïgµrætïøñ fïlë","{0} Add New SSH Host...":"{0} Æðð Ñëw §§H Høst...","{1} is not a valid host to bind":"{1} ïs ñøt æ vælïð høst tø þïñð"}
