{"\"{0}\" has fingerprint \"{1}\".":"«{0}» имеет отпечаток «{1}».","'{0}' will be executed on your local machine.":"'{0}' will be executed on your local machine.","A VS Code Server matching your local installation could not be downloaded from the internet.":"Не удалось загрузить из Интернета сервер VS Code, соответствующий вашей локальной установке.","A command required on the remote machine was not found":"Нужная команда на удаленном компьютере не найдена","Add the setting '{0}' to the server's '{1}' (or similar) configuration file":"Добавьте настройку \"{0}\" в файл конфигурации сервера \"{1}\" (или аналогичный)","After logging into Copilot Chat, return here to continue diagnosing your connection issue.":"После входа в чат Copilot вернитесь сюда, чтобы продолжить диагностику проблемы с подключением.","Allow":"Разрешить","Allow and Don't Ask Again":"Allow and Don't Ask Again","An SSH installation couldn't be found":"Не удалось найти установку SSH","An error occurred while parsing the local SSH configuration file":"При разборе локального файла конфигурации SSH возникла ошибка","Analyzing your previous SSH session logs...":"Analyzing your previous SSH session logs...","Are you sure you want to continue connecting?":"Действительно продолжить подключение?","Are you sure you want to continue?":"Действительно продолжить?","Can't assign requested address":"Не удается назначить запрошенный адрес","Cancel":"Отмена","Change value of setting {0} to '{1}'":"Измените значение настройки {0} на \"{1}\"","Chat with {0}":"Чат с {0}","Check proxy settings on local machine":"Проверьте настройки прокси-сервера на локальном компьютере","Check the Remote - SSH log for output from the script (prefixed with {0})":"Check the Remote - SSH log for output from the script (prefixed with {0})","Checking VS Code Server status failed - please install either curl or wget on the remote.":"Не удалось проверить состояние сервера VS Code. Установите curl или wget на удаленном компьютере.","Client-side server download failed":"Не удалось скачать клиентский сервер","Close Remote":"Закрыть удаленный","Config file to save in":"Файл конфигурации для сохранения в","Configure SSH Hosts...":"Настройка узлов SSH…","Connect":"Подключить","Connect to VS Code Server - retry {0}":"Подключиться к серверу VS Code Server — повторить попытку {0}","Connecting was canceled":"Подключение отменено","Continue":"Продолжить","Copying VS Code Server to host with scp":"Копирование сервера VS Code на узел с помощью SCP","Could not establish connection to \"{0}\"":"Не удалось подключиться к \"{0}\"","Could not establish connection to \"{0}\": {1}":"Не удалось подключиться к \"{0}\": {1}","Could not resolve hostname":"Не удалось разрешить имя узла","Delete the setting for this host to use the default path in the user home directory":"Удалите настройку для этого узла, чтобы использовать путь по умолчанию в домашнем каталоге пользователя","Detected Windows host, need to reconnect":"Обнаружен узел Windows, необходимо повторно подключиться","Diagnose with Copilot":"Диагностика с помощью Copilot","Disable {0}":"Отключите {0}","Discuss Remote - SSH related topics and diagnose connection issues with Copilot.  Recent connection logs will be shared with Copilot as chat context.":"Обсудить удаленные темы и связанные с SSH темы и диагностировать проблемы подключения с помощью Copilot.  Последние журналы подключений будут предоставлены Copilot в качестве контекста чата.","Do not use variables, double quotes, or other non-path characters when setting {0}":"Не используйте при задании значения {0} переменные, двойные кавычки и другие символы, не относящиеся к пути","Don't Show Again":"Больше не показывать","Download the correct VS Code that corresponds both to your local installation and the remote architecture":"Скачайте правильную версию VS Code, соответствующую как вашей локальной установке, так и удаленной архитектуре","Downloading VS Code Server":"Идет загрузка VS Code Server","Downloading VS Code Server failed - please install either curl or wget on the remote.":"Не удалось загрузить VS Code Server. Пожалуйста, установите curl или wget на удаленном компьютере.","Downloading VS Code Server failed. Please try again later.":"Не удалось загрузить VS Code Server. Пожалуйста, повторите попытку позже.","Downloading VS Code Server locally":"Локальное скачивание сервера VS Code","Downloading VS Code Server...":"Скачивание VS Code Server...","ERROR: TCP port forwarding appears to be disabled on the remote host. Ensure that the sshd_config has `AllowTcpForwarding yes`. Contact your system administrator if needed.":"ОШИБКА: переадресация TCP-портов отключена на удаленном узле. Убедитесь, что sshd_config имеет значение \"AllowTcpForwarding yes\". При необходимости обратитесь к системному администратору.","Edit custom SSH configuration file":"Изменить пользовательский файл конфигурации SSH","Edit setting {0} to an absolute path on the remote server":"Измените настройку {0}, заменив ее на абсолютный путь на удаленном сервере","Enable {0} to allow VS Code to download the required resources locally":"Включите {0}, чтобы VS Code загружала необходимые ресурсы локально","Enable {0} to allow VS Code to download the required resources via your local machine and then upload them to the remote server":"Включите {0}, чтобы позволить VS Code загружать необходимые ресурсы через ваш локальный компьютер, а затем отправлять их на удаленный сервер","Ensure '{0}' operates between local and remote machines":"Убедитесь, что \"{0}\" работает между локальным и удаленным компьютерами","Ensure curl/wget are on the remote system's '{0}'":"Убедитесь, что на удаленной системе в \"{0}\" установлена программа curl или wget","Ensure that the parent directory exists":"Убедитесь, что родительский каталог существует","Ensure that the remote server has internet access and has access to the VS Code CDN":"Убедитесь, что удаленный сервер имеет доступ к Интернету и к сети доставки содержимого (CDN) VS Code","Ensure that the remote server has internet access and that the network is not blocking the download":"Проверьте, есть ли у удаленного сервера доступ к Интернету и не блокирует ли сеть загрузку","Ensure that the remote user has write permissions to the parent directory":"Убедитесь, что удаленный пользователь имеет разрешения на запись в родительский каталог","Ensure that the {0} setting correctly reflects the remote platform. Ensure no wildcard entry is being selected erroneously":"Убедитесь, что значение параметра {0} правильно отражает удаленную платформу. Проверьте, не выбирается ли по ошибке запись с подстановочными знаками","Ensure the provide path is an absolute path":"Убедитесь, что указанный путь является абсолютным","Ensure the provided path is executable and the script exits successfully (exit code 0)":"Ensure the provided path is executable and the script exits successfully (exit code 0)","Ensure the remote machine is configured to receive incoming connections on the local network":"Убедитесь, что удаленный компьютер настроен на прием входящих подключений в локальной сети","Ensure there is sufficient free disk space on the remote machine":"Проверьте, достаточно ли места на диске удаленного компьютера","Ensure this program is installed on the remote machine and accessible via the '{0}' environment variable":"Проверьте, установлена ли эта программа на удаленном компьютере и доступна ли она через переменную среды \"{0}\"","Enter SSH Connection Command":"Введите команду подключения SSH","Enter passphrase for ssh key {0}":"Введите парольную фразу для ключа SSH {0}","Enter password":"Введите пароль","Enter password for {0}":"Введите пароль для {0}","Error establishing tunnel ({0}).":"Ошибка при установке туннеля ({0}).","Execute pre-connection script?":"Execute pre-connection script?","Expected tarball at local path {0}":"По локальному пути {0} ожидается tarball","Failed to create the remote server's install directory":"Не удалось создать каталог установки удаленного сервера","Failed to download VS Code Server ({0})":"Не удалось скачать VS Code Server ({0})","Failed to download VS Code Server locally":"Не удалось скачать VS Code Server локально","Failed to find a free local port: {0}":"Не удалось найти свободный локальный порт: {0}","Failed to find a non-Windows SSH installed. Password prompts may not be displayed properly! Disable `remote.SSH.useLocalServer` if needed./{Locked=\"`remote.SSH.useLocalServer`\"}Do not translate `remote.SSH.useLocalServer`, it is a VS Code command.":"Не удалось найти установленный SSH, отличный от Windows. Запросы пароля могут отображаться неправильно! При необходимости отключите `remote.SSH.useLocalServer`.","Failed to install the VS Code Server":"Не удалось установить сервер VS Code.","Failed to kill VS Code Server on {0}.":"Не удалось завершить работу сервера VS Code на {0}.","Help":"Справка","Host added!":"Узел добавлен!","Hostname contains invalid characters":"Имя узла содержит недопустимые символы","If your remote server is behind a firewall, ask your IT department to allow access to the VS Code CDN":"Если ваш удаленный сервер защищен брандмауэром, попросите ИТ-отдел разрешить доступ к CDN VS Code","If your remote server is behind a proxy, provide the proxy URL with setting '{0}' or '{1}'":"Если ваш удаленный сервер находится за прокси-сервером, укажите URL-адрес прокси с помощью настроек \"{0}\" или \"{1}\"","Initializing VS Code Server":"Инициализация VS Code Server","Install '{0}' on the remote server. Installation steps will vary per distribution.":"Установите \"{0}\" на удаленном сервере. Шаги по установке зависят от дистрибутива.","Installing VS Code Server":"Идет установка VS Code Server","Killed VS Code Server on {0}.":"Работа сервера VS Code на {0} завершена.","Learn More":"Дополнительные сведения","Local bootstrap of the VS Code Server failed.  This is an advanced feature for use in environments with limited internet acccess.":"Не удалось выполнить локальную начальную загрузку сервера VS Code.  Это расширенная функция для использования в средах с ограниченным доступом к Интернету.","Local download mode is configured as 'manual-bootstrap'. Exec server mode will be disabled.'":"Для локального режима загрузки задано значение \"manual-bootstrap\" (ручная начальная загрузка). Режим \"exec server\" будет отключен.","Max wait time exhausted":"Истекло максимальное время ожидания","Message":"Сообщение","Mitigations":"Устранение рисков","More Actions...":"Дополнительные действия…","More Info":"Дополнительные сведения","Network is unreachable":"Сеть недоступна","No free ports in specified range '{0}-{1}'.  Remove or update the 'Preferred Local Port Range' setting and try again.":"Нет свободных портов в указанном диапазоне \"{0}-{1}\".  Удалите или обновите параметр \"Предпочтительный диапазон локальных портов\" и повторите попытку.","No route found to remote machine with a local IPv4 address.":"Не найден маршрут к удаленному компьютеру с локальным IPv4-адресом.","No route to host":"Нет маршрута к узлу","On Mac OS, grant VS Code the 'Local Network' permission in System Settings":"На Mac OS предоставьте VS Code разрешение 'Локальная сеть' в системных настройках","Open Config":"Открыть конфигурацию","Open Documentation":"Открыть документацию","Open Logs":"Открыть журналы","Open Recent...":"Открыть недавнее…","Open SSH Configuration File":"Открыть файл конфигурации SSH","Open Settings":"Открыть параметры","Pick an action to help resolve the problem.":"Выберите действие, которое поможет устранить проблему.","Place the VS Code Server in the bootstrap location specified in settings":"Поместите сервер VS Code в расположение начальной загрузки, указанное в настройках","Port forwarding is disabled":"Переадресация портов отключена","Pre-connection script has changed since last confirmation":"Pre-connection script has changed since last confirmation","Proxy URL in settings is invalid":"Недопустимый URL-адрес прокси-сервера в настройках","Received 407 from the server":"С сервера получен код 407","Remote host key has changed, port forwarding is disabled":"Ключ удаленного узла изменен, переадресация портов отключена","Remove or edit setting {0}":"Удалите или измените настройку {0}","Remove this value from settings or correct the URL":"Удалите это значение из настроек или исправьте URL-адрес","Report this issue with an example configuration file":"Сообщите об этой проблеме, приложив пример файла конфигурации","Resources":"Ресурсы","Restart the SSH server on the remote machine to apply any changes to the configuration":"Перезапустите SSH-сервер на удаленном компьютере, чтобы применить изменения в конфигурации (при наличии таковых)","Retry":"Повторить попытку","Running pre-connection script ({0})":"Running pre-connection script ({0})","SSH host name cannot begin with {0}":"Имя узла SSH не может начинаться с {0}","SSH host name cannot include the character {0}":"Имя узла SSH не может включать символ {0}","SSH user name cannot begin with {0}":"Имя пользователя SSH не может начинаться с {0}","SSH user name cannot include the character {0}":"Имя пользователя SSH не может содержать символ {0}","Search '{0}' in settings":"Найдите в параметрах \"{0}\"","See output log for server installation URL":"Просмотрите журнал выдачи, чтобы найти URL-адрес установки сервера","See verbose information in the":"См. подробные сведения в","Select SSH configuration file to update":"Выберите файл конфигурации SSH для обновления","Select configured SSH host or enter user@host/Translate user@host such that both user and host are translated but joined by an \"@\" sign.":"Выберите настроенный узел SSH или введите user@host","Set '{0}' in VS Code settings to use the correct proxy":"Установите \"{0}\" в настройках VS Code, чтобы использовать правильный прокси-сервер","Setting up SSH Host {0}":"Настройка узла SSH {0}","Setting up SSH tunnel":"Настройка туннеля SSH","Settings":"Параметры","Show details in terminal":"Показать сведения в терминале","Skip":"Пропустить","Status":"Состояние","The VS Code Server failed to start":"Не удалось запустить VS Code Server","The VS Code Server terminated due to presence of CVE-2020-1416. Check the Remote-SSH output channel for more details.":"Сервер VS Code остановлен из-за наличия CVE-2020-1416. Дополнительные сведения см. в канале вывода Remote-SSH.","The connection timed out":"Время ожидания соединения истекло","The following issues were detected in your most recent Remote - SSH session":"В вашем недавнем сеансе удаленного доступа — SSH обнаружены следующие проблемы","The install directory on the remote host could not be created. By default this is the '{0}' directory and can be overridden with the setting {1}":"Не удалось создать каталог установки на удаленном узле. По умолчанию это каталог \"{0}\", и его можно переопределить с помощью настройки {1}","The operation timed out":"Время ожидания операции истекло.","The pre-connect script has failed":"The pre-connect script has failed","The process tried to write to a nonexistent pipe":"Процесс пытался сделать запись в несуществующий канал","The provided custom server path is invalid":"Указанный путь к пользовательскому серверу недопустим","The remote host does not meet the prerequisites for running VS Code Server":"Удаленный хост не соответствует предварительным требованиям для запуска VS Code Server","The remote host may not meet VS Code Server's prerequisites for glibc and libstdc++":"Удаленный узел может не соответствовать предварительным требованиям сервера VS Code для glibc и libstdc++.","The remote host's architecture is not supported":"Архитектура удаленного узла не поддерживается","The remote host's architecture is only supported on VS Code Insiders":"Архитектура удаленного узла поддерживается только в программе предварительной оценки VS Code","The remote host's platform is not supported":"Платформа удаленного узла не поддерживается","The remote server has terminated the connection due to a known and preventable security vulnerability":"Удаленный сервер прервал подключение из-за известной и предотвратимой уязвимости безопасности","The remote server's SSH configuration may have TCP forwarding disabled":"Возможно, в конфигурации SSH удаленного сервера отключена пересылка TCP","URL must include the scheme ({0} or {1})":"URL-адрес должен содержать схему ({0} или {1})","URL should not contain non-URL characters":"URL-адрес не должен содержать недопустимые символы","Unsupported script type. Provide a .ps1 script on Windows.":"Unsupported script type. Provide a .ps1 script on Windows.","Update VS Code and try again later":"Обновите VS Code и попробуйте еще раз через некоторое время","Update the remote.SSH.preconnect setting":"Update the remote.SSH.preconnect setting","View the Output Log to see mitigation steps provided by the VS Code Server":"Просмотрите журнал выдачи, чтобы увидеть шаги по устранению проблем, предоставленные сервером VS Code","Waiting for other windows to connect":"Ожидание подключения других окон","Waiting for port forwarding to be ready":"Ожидание готовности переадресации портов","When first establishing a connection to the remote server, various resources must be installed from the internet. A program (either \"wget\" or \"curl\") is used to download these resources, but they are not installed on the remote server.  When this step fails, the extension attempts to use the local machine to download the resources and then upload them to the remote server.":"При первом подключении к удаленному серверу необходимо установить различные ресурсы из Интернета. Для загрузки этих ресурсов используется программа (либо \"wget\", либо \"curl\"), но они не установлены на удаленном сервере.  Если этот шаг не удается выполнить, расширение пытается использовать локальный компьютер для загрузки ресурсов и их последующей отправки на удаленный сервер.","Windows hosts are only supported on VS Code Insiders":"Узлы Windows поддерживаются только в программе предварительной оценки VS Code.","Windows remotes do not support local bootstrap":"Удаленные компьютеры Windows не поддерживают локальную начальную загрузку","about SSH configuration files":"сведения о файлах конфигурации SSH","bash not found":"Оболочка Bash не найдена","click on an issue to continue in Copilot Chat.":"щелкните проблему, чтобы продолжить в чате Copilot.","https://aka.ms/vscode-remote/faq/old-linux":"https://aka.ms/vscode-remote/faq/old-linux","specify a custom configuration file":"укажите настраиваемый файл конфигурации","{0} Add New SSH Host...":"{0} Добавить новый узел SSH","{1} is not a valid host to bind":"{1} не является допустимым узлом для привязки"}
