{"\"{0}\" has fingerprint \"{1}\".":"« {0} » a une empreinte digitale « {1} ».","'{0}' will be executed on your local machine.":"'{0}' will be executed on your local machine.","A VS Code Server matching your local installation could not be downloaded from the internet.":"Un serveur VS Code correspondant à votre installation locale n’a pas pu être téléchargé à partir d’Internet.","A command required on the remote machine was not found":"Une commande requise sur l’ordinateur distant est introuvable","Add the setting '{0}' to the server's '{1}' (or similar) configuration file":"Ajouter le paramètre « {0} » au fichier de configuration du serveur « {1} » (ou similaire)","After logging into Copilot Chat, return here to continue diagnosing your connection issue.":"Une fois connecté à Copilot Chat, revenez ici pour continuer à diagnostiquer votre problème de connexion.","Allow":"Autoriser","Allow and Don't Ask Again":"Allow and Don't Ask Again","An SSH installation couldn't be found":"Installation SSH introuvable","An error occurred while parsing the local SSH configuration file":"Une erreur survient lors de l’analyse du fichier de configuration SSH local","Analyzing your previous SSH session logs...":"Analyzing your previous SSH session logs...","Are you sure you want to continue connecting?":"Voulez-vous vraiment continuer à vous connecter ?","Are you sure you want to continue?":"Êtes-vous sûr de vouloir continuer ?","Can't assign requested address":"Impossible d’attribuer l’adresse demandée","Cancel":"Annuler","Change value of setting {0} to '{1}'":"Modifiez la valeur du paramètre {0} en « {1} »","Chat with {0}":"Discuter avec {0}","Check proxy settings on local machine":"Vérifiez les paramètres du proxy sur l’ordinateur local","Check the Remote - SSH log for output from the script (prefixed with {0})":"Check the Remote - SSH log for output from the script (prefixed with {0})","Checking VS Code Server status failed - please install either curl or wget on the remote.":"Échec de la vérification de l’état du serveur VS Code. Installez curl ou wget sur le serveur distant.","Client-side server download failed":"Échec du téléchargement du serveur côté client","Close Remote":"Fermer la télécommande","Config file to save in":"Fichier de configuration dans lequel enregistrer","Configure SSH Hosts...":"Configurer les hôtes SSH...","Connect":"Se connecter","Connect to VS Code Server - retry {0}":"Connecter au serveur VS Code – réessayez {0}","Connecting was canceled":"La connexion a été annulée","Continue":"Continuer","Copying VS Code Server to host with scp":"Copie du serveur VS Code sur l’hôte avec SCP","Could not establish connection to \"{0}\"":"Impossible d’établir la connexion à « {0} »","Could not establish connection to \"{0}\": {1}":"Impossible d’établir la connexion à « {0} » : {1}","Could not resolve hostname":"Impossible de résoudre le nom d'hôte","Delete the setting for this host to use the default path in the user home directory":"Supprimez le paramètre qui permet à cet hôte d’utiliser le chemin d’accès par défaut dans le répertoire personnel de l’utilisateur","Detected Windows host, need to reconnect":"Hôte Windows détecté, reconnexion nécessaire","Diagnose with Copilot":"Diagnostiquer avec Copilot","Disable {0}":"Désactivez {0}","Discuss Remote - SSH related topics and diagnose connection issues with Copilot.  Recent connection logs will be shared with Copilot as chat context.":"Discutez des sujets liés à Remote - SSH et diagnostiquez les problèmes de connexion avec Copilot.  Les journaux de connexion récents seront partagés avec Copilot en tant que contexte de conversation.","Do not use variables, double quotes, or other non-path characters when setting {0}":"Lorsque vous définissez {0}, n’utilisez pas de variables, de guillemets doubles ou d’autres caractères qui ne sont pas utilisés pour les chemins d’accès","Don't Show Again":"Ne plus afficher","Download the correct VS Code that corresponds both to your local installation and the remote architecture":"Téléchargez le VS Code approprié qui correspond à la fois à votre installation locale et à l’architecture distante","Downloading VS Code Server":"Téléchargement du serveur VS Code","Downloading VS Code Server failed - please install either curl or wget on the remote.":"Échec du téléchargement de VS Code Server – Installez curl ou wget sur le serveur distant.","Downloading VS Code Server failed. Please try again later.":"Échec du téléchargement du serveur VS Code. Veuillez réessayer plus tard.","Downloading VS Code Server locally":"Téléchargement de VS Code Server localement","Downloading VS Code Server...":"Téléchargement du serveur VS Code...","ERROR: TCP port forwarding appears to be disabled on the remote host. Ensure that the sshd_config has `AllowTcpForwarding yes`. Contact your system administrator if needed.":"Erreur : le transfert de port TCP semble être désactivé sur l’hôte distant. Assurez-vous que le sshd_config a « AllowTcpForwarding yes ». Contactez votre administrateur système si nécessaire.","Edit custom SSH configuration file":"Modifier le fichier de configuration SSH personnalisé","Edit setting {0} to an absolute path on the remote server":"Modifiez le paramètre {0} pour un chemin d’accès absolu sur le serveur distant","Enable {0} to allow VS Code to download the required resources locally":"Activez {0} pour permettre à VS Code de télécharger les ressources nécessaires localement","Enable {0} to allow VS Code to download the required resources via your local machine and then upload them to the remote server":"Activez {0} pour permettre à VS Code de télécharger les ressources nécessaires via votre ordinateur local, puis de les charger sur le serveur distant","Ensure '{0}' operates between local and remote machines":"Vérifiez que « {0} » fonctionne entre les ordinateurs locaux et distants","Ensure curl/wget are on the remote system's '{0}'":"Vérifiez que curl/wget est présent sur le ’{0}’ du système distant","Ensure that the parent directory exists":"Vérifiez que le répertoire parent existe","Ensure that the remote server has internet access and has access to the VS Code CDN":"Vérifiez que le serveur distant dispose d’un accès à Internet et qu’il a accès au réseau de distribution de contenu (CDN) de VS Code","Ensure that the remote server has internet access and that the network is not blocking the download":"Vérifiez que le serveur distant dispose d’un accès à Internet et que le réseau ne bloque pas le téléchargement","Ensure that the remote user has write permissions to the parent directory":"Vérifiez que l’utilisateur distant dispose des droits d’écriture sur le répertoire parent","Ensure that the {0} setting correctly reflects the remote platform. Ensure no wildcard entry is being selected erroneously":"Vérifiez que le paramètre {0} correspond bien à la plateforme distante. Vérifie qu’aucune entrée de caractère générique n’est sélectionnée par erreur","Ensure the provide path is an absolute path":"Vérifiez que le chemin d’accès fourni est un chemin d’accès absolu","Ensure the provided path is executable and the script exits successfully (exit code 0)":"Ensure the provided path is executable and the script exits successfully (exit code 0)","Ensure the remote machine is configured to receive incoming connections on the local network":"Vérifiez que l’ordinateur distant est configuré pour recevoir des connexions entrantes sur le réseau local","Ensure there is sufficient free disk space on the remote machine":"Vérifiez que l’ordinateur distant dispose de suffisamment d’espace disque disponible","Ensure this program is installed on the remote machine and accessible via the '{0}' environment variable":"Assurez-vous que ce programme est installé sur l’ordinateur distant et qu’il est accessible via la variable d’environnement « {0} »","Enter SSH Connection Command":"Entrer la commande de connexion SSH","Enter passphrase for ssh key {0}":"Entrer la phrase secrète pour la clé SSH {0}","Enter password":"Entrer le mot de passe","Enter password for {0}":"Entrer le mot de passe pour {0}","Error establishing tunnel ({0}).":"Erreur lors de l’établissement du tunnel ({0}).","Execute pre-connection script?":"Execute pre-connection script?","Expected tarball at local path {0}":"Le tarball attendu se trouve dans le chemin d’accès local {0}","Failed to create the remote server's install directory":"Échec de la création du répertoire d’installation du serveur distant","Failed to download VS Code Server ({0})":"Échec du téléchargement de VS Code Server ({0})","Failed to download VS Code Server locally":"Échec du téléchargement du serveur VS Code localement","Failed to find a free local port: {0}":"Impossible de trouver un port local libre : {0}","Failed to find a non-Windows SSH installed. Password prompts may not be displayed properly! Disable `remote.SSH.useLocalServer` if needed./{Locked=\"`remote.SSH.useLocalServer`\"}Do not translate `remote.SSH.useLocalServer`, it is a VS Code command.":"SSH non Windows installé introuvable. Les invites de mot de passe ne sont peut-être pas affichées correctement ! Désactivez `remote.SSH.useLocalServer` si nécessaire.","Failed to install the VS Code Server":"Échec de l’installation du serveur VS Code","Failed to kill VS Code Server on {0}.":"Échec de l’arrêt du serveur VS Code sur {0}.","Help":"Aide","Host added!":"Hôte ajouté !","Hostname contains invalid characters":"Le nom d’hôte contient des caractères non valides","If your remote server is behind a firewall, ask your IT department to allow access to the VS Code CDN":"Si votre serveur distant se trouve derrière un pare-feu, demandez à votre service informatique d’autoriser l’accès au réseau de distribution de contenu (CDN) de VS Code","If your remote server is behind a proxy, provide the proxy URL with setting '{0}' or '{1}'":"Si votre serveur distant se trouve derrière un proxy, indiquez l’URL du proxy avec le paramètre « {0} » ou « {1} »","Initializing VS Code Server":"Initialisation du serveur VS Code","Install '{0}' on the remote server. Installation steps will vary per distribution.":"Installez « {0} » sur le serveur distant. Les étapes d’installation varient selon la distribution.","Installing VS Code Server":"Installation du serveur VS Code","Killed VS Code Server on {0}.":"Serveur VS Code arrêté sur {0}.","Learn More":"En savoir plus","Local bootstrap of the VS Code Server failed.  This is an advanced feature for use in environments with limited internet acccess.":"Le démarrage local du serveur VS Code a échoué.  Cette fonctionnalité avancée est destinée à être utilisée dans des environnements où l’accès à l’internet est limité.","Local download mode is configured as 'manual-bootstrap'. Exec server mode will be disabled.'":"Le mode de téléchargement local est configuré en tant que « manual-bootstrap ». Le mode serveur d’exécution (Exec) sera désactivé.","Max wait time exhausted":"Temps d’attente maximal épuisé","Message":"Message","Mitigations":"Atténuation","More Actions...":"Plus d’actions...","More Info":"Informations supplémentaires","Network is unreachable":"Le réseau est inaccessible","No free ports in specified range '{0}-{1}'.  Remove or update the 'Preferred Local Port Range' setting and try again.":"Aucun port libre dans la plage spécifiée « {0}-{1} ».  Supprimez ou mettez à jour le paramètre « Plage de ports locaux préférés », puis réessayez.","No route found to remote machine with a local IPv4 address.":"Aucun itinéraire n’a été trouvé vers l’ordinateur distant avec une adresse IPv4 locale.","No route to host":"Aucun itinéraire vers l’hôte","On Mac OS, grant VS Code the 'Local Network' permission in System Settings":"Sous Mac OS, dans les paramètres du système, accordez à VS Code l’autorisation « Réseau local »","Open Config":"Ouvrir la configuration","Open Documentation":"Ouvrir la documentation","Open Logs":"Journaux ouverts","Open Recent...":"Ouverte récente...","Open SSH Configuration File":"Ouvrir le fichier de configuration SSH","Open Settings":"Ouvrez les Paramètres","Pick an action to help resolve the problem.":"Choisissez une action pour vous aider à résoudre le problème.","Place the VS Code Server in the bootstrap location specified in settings":"Placez le serveur VS Code dans l’emplacement de démarrage spécifié dans les paramètres","Port forwarding is disabled":"Le transfert de port est désactivé","Pre-connection script has changed since last confirmation":"Pre-connection script has changed since last confirmation","Proxy URL in settings is invalid":"L’URL du proxy dans les paramètres n’est pas valide","Received 407 from the server":"Le serveur retourne 407","Remote host key has changed, port forwarding is disabled":"La clé hôte distante a changé, le transfert de port est désactivé","Remove or edit setting {0}":"Supprimer ou modifier le paramètre {0}","Remove this value from settings or correct the URL":"Supprimez cette valeur des paramètres ou corrigez l’URL","Report this issue with an example configuration file":"Signalez ce problème avec un exemple de fichier de configuration","Resources":"Ressources","Restart the SSH server on the remote machine to apply any changes to the configuration":"Pour appliquer les modifications apportées à la configuration, redémarrez le serveur SSH sur l’ordinateur distant","Retry":"Réessayer","Running pre-connection script ({0})":"Running pre-connection script ({0})","SSH host name cannot begin with {0}":"Le nom d’hôte SSH ne peut pas commencer par {0}","SSH host name cannot include the character {0}":"Le nom d’hôte SSH ne peut pas inclure le caractère {0}","SSH user name cannot begin with {0}":"Le nom d’utilisateur SSH ne peut pas commencer par {0}","SSH user name cannot include the character {0}":"Le nom d’utilisateur SSH ne peut pas inclure le caractère {0}","Search '{0}' in settings":"Recherchez « {0} » dans les paramètres","See output log for server installation URL":"Consultez le journal de sortie pour l’URL d’installation du serveur","See verbose information in the":"Afficher des informations détaillées dans le","Select SSH configuration file to update":"Sélectionner le fichier de configuration SSH à mettre à jour","Select configured SSH host or enter user@host/Translate user@host such that both user and host are translated but joined by an \"@\" sign.":"Sélectionnez l’hôte SSH configuré ou entrez user@host","Set '{0}' in VS Code settings to use the correct proxy":"Définissez « {0} » dans les paramètres de VS Code pour utiliser le proxy approprié","Setting up SSH Host {0}":"Configuration des {0} de l’hôte SSH","Setting up SSH tunnel":"Configuration du tunnel SSH","Settings":"Paramètres","Show details in terminal":"Afficher les détails dans le terminal","Skip":"Ignorer","Status":"État","The VS Code Server failed to start":"Échec du démarrage du serveur VS Code","The VS Code Server terminated due to presence of CVE-2020-1416. Check the Remote-SSH output channel for more details.":"Le serveur VS Code s’est arrêté en raison de la présence de CVE-2020-1416. Pour plus d’informations, consultez le canal de sortie Remote-SSH.","The connection timed out":"Expiration du délai de connexion","The following issues were detected in your most recent Remote - SSH session":"Les problèmes suivants ont été détectés dans votre dernière session Remote – SSH","The install directory on the remote host could not be created. By default this is the '{0}' directory and can be overridden with the setting {1}":"Impossible de créer le répertoire d’installation sur l’hôte distant. Le répertoire par défaut est « {0} » et il peut être remplacé par le paramètre {1}","The operation timed out":"L'opération a expiré.","The pre-connect script has failed":"The pre-connect script has failed","The process tried to write to a nonexistent pipe":"Le processus a tenté d’écrire dans un canal inexistant","The provided custom server path is invalid":"Le chemin d’accès au serveur personnalisé fourni n’est pas valide","The remote host does not meet the prerequisites for running VS Code Server":"L’hôte distant ne répond pas aux conditions préalables pour exécuter VS Code Server","The remote host may not meet VS Code Server's prerequisites for glibc and libstdc++":"L’hôte distant peut ne pas répondre aux conditions préalables de VS Code Server pour glibc et libstdc++","The remote host's architecture is not supported":"L’architecture de l’hôte distant n’est pas prise en charge","The remote host's architecture is only supported on VS Code Insiders":"L’architecture de l’hôte distant est uniquement prise en charge sur les Insiders VS Code","The remote host's platform is not supported":"La plateforme de l’hôte distant n’est pas prise en charge","The remote server has terminated the connection due to a known and preventable security vulnerability":"Le serveur distant a mis fin à la connexion en raison d’une faille de sécurité connue et évitable","The remote server's SSH configuration may have TCP forwarding disabled":"Le transfert TCP est peut-être désactivé dans la configuration SSH du serveur distant","URL must include the scheme ({0} or {1})":"L’URL doit inclure le schéma ({0} ou {1})","URL should not contain non-URL characters":"L’URL ne doit pas contenir de caractères non valides","Unsupported script type. Provide a .ps1 script on Windows.":"Unsupported script type. Provide a .ps1 script on Windows.","Update VS Code and try again later":"Mettez à jour le VS Code et réessayez plus tard","Update the remote.SSH.preconnect setting":"Update the remote.SSH.preconnect setting","View the Output Log to see mitigation steps provided by the VS Code Server":"Pour voir les étapes d’atténuation fournies par le serveur VS Code, consultez le journal de sortie","Waiting for other windows to connect":"En attente de la connexion d’autres fenêtres","Waiting for port forwarding to be ready":"En attente de la préparation du transfert de port","When first establishing a connection to the remote server, various resources must be installed from the internet. A program (either \"wget\" or \"curl\") is used to download these resources, but they are not installed on the remote server.  When this step fails, the extension attempts to use the local machine to download the resources and then upload them to the remote server.":"Lors de la première connexion au serveur distant, diverses ressources doivent être installées à partir d’Internet. Un programme (soit « wget », soit « curl ») est utilisé pour télécharger ces ressources, mais elles ne sont pas installées sur le serveur distant.  Si cette étape échoue, l’extension tente d’utiliser l’ordinateur local pour télécharger les ressources, puis de les charger sur le serveur distant.","Windows hosts are only supported on VS Code Insiders":"Les hôtes Windows ne sont pris en charge que sur les Insiders VS Code","Windows remotes do not support local bootstrap":"Les télécommandes Windows ne prennent pas en charge le démarrage local","about SSH configuration files":"à propos des fichiers de configuration SSH","bash not found":"bash introuvable","click on an issue to continue in Copilot Chat.":"cliquez sur un problème pour continuer dans Copilot Chat.","https://aka.ms/vscode-remote/faq/old-linux":"https://aka.ms/vscode-remote/faq/old-linux","specify a custom configuration file":"spécifier un fichier de configuration personnalisé","{0} Add New SSH Host...":"{0} ajouter un nouvel hôte SSH...","{1} is not a valid host to bind":"{1} n'est pas un hôte valide à lier"}
