{"\"{0}\" has fingerprint \"{1}\".":"\"{0}\" のフィンガープリントは \"{1}\" です。","'{0}' will be executed on your local machine.":"'{0}' will be executed on your local machine.","A VS Code Server matching your local installation could not be downloaded from the internet.":"ローカル インストールに一致する VS Code サーバーをインターネットからダウンロードできませんでした。","A command required on the remote machine was not found":"リモート マシンで必要なコマンドが見つかりませんでした","Add the setting '{0}' to the server's '{1}' (or similar) configuration file":"設定 \"{0}\" をサーバーの \"{1}\" (または同様の) 構成ファイルに追加してください","After logging into Copilot Chat, return here to continue diagnosing your connection issue.":"Copilot チャットにログインしたら、ここに戻って接続の問題の診断を続行します。","Allow":"許可","Allow and Don't Ask Again":"Allow and Don't Ask Again","An SSH installation couldn't be found":"SSH インストールが見つかりませんでした","An error occurred while parsing the local SSH configuration file":"ローカル SSH 構成ファイルの解析中にエラーが発生しました","Analyzing your previous SSH session logs...":"Analyzing your previous SSH session logs...","Are you sure you want to continue connecting?":"接続を続行しますか?","Are you sure you want to continue?":"続行しますか?","Can't assign requested address":"要求されたアドレスを割り当てることができません","Cancel":"キャンセル","Change value of setting {0} to '{1}'":"設定 {0} の値を \"{1}\" に変更してください","Chat with {0}":"{0} とのチャット","Check proxy settings on local machine":"ローカル コンピューターのプロキシ設定を確認してください","Check the Remote - SSH log for output from the script (prefixed with {0})":"Check the Remote - SSH log for output from the script (prefixed with {0})","Checking VS Code Server status failed - please install either curl or wget on the remote.":"VS Code Server の状態を確認できませんでした。リモートに curl または wget をインストールしてください。","Client-side server download failed":"クライアント側サーバーのダウンロードに失敗しました","Close Remote":"リモートを閉じる","Config file to save in":"保存する Config ファイル","Configure SSH Hosts...":"SSH ホストを構成する...","Connect":"接続","Connect to VS Code Server - retry {0}":"VS Code Server に接続する - {0}を再試行してください","Connecting was canceled":"接続がキャンセルされました","Continue":"続行","Copying VS Code Server to host with scp":"SCP を使用して VS Code Server をホストにコピーしています","Could not establish connection to \"{0}\"":"\"{0}\" への接続を確立できません","Could not establish connection to \"{0}\": {1}":"\"{0}\" への接続を確立できません: {1}","Could not resolve hostname":"ホスト名を解決できません","Delete the setting for this host to use the default path in the user home directory":"ユーザーのホーム ディレクトリの既定のパスを使用するには、このホストの設定を削除してください","Detected Windows host, need to reconnect":"Windows ホストが検出されました。再接続する必要があります","Diagnose with Copilot":"Copilot で診断する","Disable {0}":"{0} を無効にしてください","Discuss Remote - SSH related topics and diagnose connection issues with Copilot.  Recent connection logs will be shared with Copilot as chat context.":"リモートについて話し合う - SSH 関連のトピックを参照し、Copilot で接続の問題を診断します。 最近の接続ログは、チャット コンテキストとして Copilot と共有されます。","Do not use variables, double quotes, or other non-path characters when setting {0}":"{0} を設定するときは、変数、二重引用符、その他のパス文字以外の文字を使用しないでください","Don't Show Again":"再表示しない","Download the correct VS Code that corresponds both to your local installation and the remote architecture":"ローカル インストールとリモート アーキテクチャの両方に対応する正しい VS Code をダウンロードしてください","Downloading VS Code Server":"VS Code Server をダウンロードしています","Downloading VS Code Server failed - please install either curl or wget on the remote.":"VS Code Server をダウンロードできませんでした。リモートに curl または wget をインストールしてください。","Downloading VS Code Server failed. Please try again later.":"VS Code Server のダウンロードに失敗しました。後でもう一度お試しください。","Downloading VS Code Server locally":"VS Code Server をローカルでダウンロードしています","Downloading VS Code Server...":"VS Code Server をダウンロードしています...","ERROR: TCP port forwarding appears to be disabled on the remote host. Ensure that the sshd_config has `AllowTcpForwarding yes`. Contact your system administrator if needed.":"エラー: TCP ポート 転送がリモート ホストで無効になっている可能性があります。sshd_config に 'AllowTcpForwarding yes' が設定されていることを確認します。必要に応じて、システム管理者にお問い合わせください。","Edit custom SSH configuration file":"カスタム SSH 構成ファイルを編集する","Edit setting {0} to an absolute path on the remote server":"リモートサーバー上で {0} 設定を絶対パスに編集してください","Enable {0} to allow VS Code to download the required resources locally":"{0} を有効にして、VS Code にローカル コンピューター経由での必要なリソースのダウンロードを許可してください","Enable {0} to allow VS Code to download the required resources via your local machine and then upload them to the remote server":"{0} を有効にして、VS Code にローカル コンピューター経由での必要なリソースのダウンロードと、リモート サーバーへのアップロードを許可してください","Ensure '{0}' operates between local and remote machines":"ローカル コンピューターとリモート マシンの間で \"{0}\" が動作することを確認してください","Ensure curl/wget are on the remote system's '{0}'":"curl/wget がリモート システムの \"{0}\" にあることを確認してください","Ensure that the parent directory exists":"親ディレクトリが存在することを確認してください","Ensure that the remote server has internet access and has access to the VS Code CDN":"リモート サーバーがインターネットにアクセスでき、VS Code CDN にアクセスできることを確認してください","Ensure that the remote server has internet access and that the network is not blocking the download":"リモート サーバーがインターネットにアクセスできること、およびネットワークによりダウンロードがブロックされていないことを確認してください","Ensure that the remote user has write permissions to the parent directory":"リモート ユーザーが親ディレクトリへの書き込みアクセス許可を持っていることを確認してください","Ensure that the {0} setting correctly reflects the remote platform. Ensure no wildcard entry is being selected erroneously":"{0} 設定にリモート プラットフォームが正しく反映されていることを確認してください。ワイルドカード文字エントリが誤って選択されていないことを確認してください","Ensure the provide path is an absolute path":"指定パスが絶対パスであることを確認してください","Ensure the provided path is executable and the script exits successfully (exit code 0)":"Ensure the provided path is executable and the script exits successfully (exit code 0)","Ensure the remote machine is configured to receive incoming connections on the local network":"ローカル ネットワーク上の着信接続がリモート マシンで受信できるように構成されていることを確認してください","Ensure there is sufficient free disk space on the remote machine":"リモート マシンに十分な空きディスク領域があることを確認してください","Ensure this program is installed on the remote machine and accessible via the '{0}' environment variable":"このプログラムがリモート マシンにインストールされており、\"{0}\" 環境変数からアクセスできることを確認してください","Enter SSH Connection Command":"SSH 接続コマンドを入力する","Enter passphrase for ssh key {0}":"SSH キー {0} のパスフレーズを入力してください","Enter password":"パスワードを入力","Enter password for {0}":"{0}のパスワードを入力する","Error establishing tunnel ({0}).":"トンネルの確立中にエラーが発生しました ({0})。","Execute pre-connection script?":"Execute pre-connection script?","Expected tarball at local path {0}":"ローカル パス {0} に必要な tarball","Failed to create the remote server's install directory":"リモート サーバーのインストール ディレクトリを作成できませんでした","Failed to download VS Code Server ({0})":"VS Code Server ({0}) をダウンロードできませんでした","Failed to download VS Code Server locally":"VS Code Server をローカルにダウンロードできませんでした","Failed to find a free local port: {0}":"空きローカル ポートが見つかりませんでした: {0}","Failed to find a non-Windows SSH installed. Password prompts may not be displayed properly! Disable `remote.SSH.useLocalServer` if needed./{Locked=\"`remote.SSH.useLocalServer`\"}Do not translate `remote.SSH.useLocalServer`, it is a VS Code command.":"インストールされている Windows 標準以外の SSH が見つかりませんでした。パスワード プロンプトが正しく表示されない可能性があります! 必要な場合、`remote.SSH.useLocalServer` を無効にしてください。","Failed to install the VS Code Server":"VS Code Server をインストールできませんでした","Failed to kill VS Code Server on {0}.":"{0}上の VS Code Server を強制終了できませんでした。","Help":"ヘルプ","Host added!":"ホストが追加されました!","Hostname contains invalid characters":"ホスト名に無効の文字が含まれています","If your remote server is behind a firewall, ask your IT department to allow access to the VS Code CDN":"リモート サーバーがファイアウォールの内側にある場合は、IT 部門にVS Code CDN へのアクセスを許可するように依頼してください","If your remote server is behind a proxy, provide the proxy URL with setting '{0}' or '{1}'":"リモート サーバーがプロキシの内側にある場合は、\"{0}\" または \"{1}\" を設定してプロキシ URL を指定してください","Initializing VS Code Server":"VS Code Server を初期化中","Install '{0}' on the remote server. Installation steps will vary per distribution.":"リモートサーバーに \"{0}\" をインストールします。インストール手順はディストリビューションによって異なります。","Installing VS Code Server":"VS Code Server をインストールしています","Killed VS Code Server on {0}.":"{0}上の VS Code Server を強制終了しました。","Learn More":"詳細情報","Local bootstrap of the VS Code Server failed.  This is an advanced feature for use in environments with limited internet acccess.":"VS Code サーバーのローカル ブートストラップに失敗しました。これは、インターネットアクセスが制限された環境で使用するための高度な機能です。","Local download mode is configured as 'manual-bootstrap'. Exec server mode will be disabled.'":"ローカル ダウンロード モードが \"手動ブートストラップ\" として構成されています。Exec サーバーモードは無効になります。","Max wait time exhausted":"最大待機時間を使い切りました","Message":"メッセージ","Mitigations":"緩和 策","More Actions...":"その他の操作...","More Info":"詳細情報","Network is unreachable":"ネットワークに到達できません","No free ports in specified range '{0}-{1}'.  Remove or update the 'Preferred Local Port Range' setting and try again.":"指定された範囲 '{0}-{1}' に空きポートがありません。'優先ローカル ポート範囲' 設定を削除または更新して、もう一度やり直してください。","No route found to remote machine with a local IPv4 address.":"ローカル IPv4 アドレスを持つリモート マシンへのルートが見つかりませんでした。","No route to host":"ホストへのルートがありません","On Mac OS, grant VS Code the 'Local Network' permission in System Settings":"Mac OS の [システム設定] で VS Code に \"ローカル ネットワーク\" アクセス許可を付与してください","Open Config":"構成を開く","Open Documentation":"ドキュメントを開く","Open Logs":"ログを開く","Open Recent...":"最近のファイルを開く...","Open SSH Configuration File":"SSH 構成ファイルを開く","Open Settings":"設定を開く","Pick an action to help resolve the problem.":"問題の解決に役立つアクションを選択してください。","Place the VS Code Server in the bootstrap location specified in settings":"VS Code サーバーを設定で指定されたブートストラップの場所に配置してください","Port forwarding is disabled":"ポート転送が無効になっています","Pre-connection script has changed since last confirmation":"Pre-connection script has changed since last confirmation","Proxy URL in settings is invalid":"設定のプロキシ URL が無効です","Received 407 from the server":"サーバーから 407 を受信しました","Remote host key has changed, port forwarding is disabled":"リモート ホスト キーが変更されたため、ポート転送は無効になっています","Remove or edit setting {0}":"設定 {0} を削除または編集してください","Remove this value from settings or correct the URL":"この値を設定から削除するか、URL を修正してください","Report this issue with an example configuration file":"構成ファイルの例を使用してこの問題を報告してください","Resources":"リソース","Restart the SSH server on the remote machine to apply any changes to the configuration":"構成に変更を適用するには、リモート マシンで SSH サーバーを再起動してください","Retry":"再試行","Running pre-connection script ({0})":"Running pre-connection script ({0})","SSH host name cannot begin with {0}":"SSH ホスト名の先頭には {0} を使用できません","SSH host name cannot include the character {0}":"SSH ホスト名に文字 {0} を含めることはできません","SSH user name cannot begin with {0}":"SSH ユーザー名の先頭には {0} を使用できません","SSH user name cannot include the character {0}":"SSH ユーザー名に文字 {0} を含めることはできません","Search '{0}' in settings":"設定で \"{0}\" を検索してください","See output log for server installation URL":"サーバー インストール URL の出力ログを参照してください","See verbose information in the":"詳細情報の参照先: ","Select SSH configuration file to update":"更新する SSH 構成ファイルを選択する","Select configured SSH host or enter user@host/Translate user@host such that both user and host are translated but joined by an \"@\" sign.":"構成済みの SSH ホストを選択するか、user@host を入力します","Set '{0}' in VS Code settings to use the correct proxy":"正しいプロキシを使用するには、VS Code 設定で '{0}' を設定してください","Setting up SSH Host {0}":"SSH ホスト {0} を設定しています","Setting up SSH tunnel":"SSH トンネルを設定する","Settings":"設定","Show details in terminal":"ターミナルに詳細を表示する","Skip":"スキップ","Status":"状態","The VS Code Server failed to start":"VS Code Server を起動できませんでした","The VS Code Server terminated due to presence of CVE-2020-1416. Check the Remote-SSH output channel for more details.":"CVE-2020-1416 が存在するため、VS Code Server が終了しました。詳細については、Remote-SSH 出力チャネルを確認してください。","The connection timed out":"接続がタイムアウトしました","The following issues were detected in your most recent Remote - SSH session":"直近の Remote - SSH セッションで以下の問題が検出されました","The install directory on the remote host could not be created. By default this is the '{0}' directory and can be overridden with the setting {1}":"リモート ホストにインストール ディレクトリを作成できませんでした。既定では、これは \"{0}\" ディレクトリであり、設定 {1}でオーバーライドできます","The operation timed out":"処理がタイムアウトになりました","The pre-connect script has failed":"The pre-connect script has failed","The process tried to write to a nonexistent pipe":"プロセスが存在しないパイプに書き込もうとしました","The provided custom server path is invalid":"指定されたカスタム サーバー パスが無効です","The remote host does not meet the prerequisites for running VS Code Server":"リモート ホストは、VS Code Server を実行するための前提条件を満たしていません","The remote host may not meet VS Code Server's prerequisites for glibc and libstdc++":"リモート ホストは、glibc および libstdc++ の VS Code Server の前提条件を満たしていない可能性があります","The remote host's architecture is not supported":"リモート ホストのアーキテクチャはサポートされていません","The remote host's architecture is only supported on VS Code Insiders":"リモート ホストのアーキテクチャは、VS Code Insider でのみサポートされています","The remote host's platform is not supported":"リモート ホストのプラットフォームはサポートされていません","The remote server has terminated the connection due to a known and preventable security vulnerability":"既知の予防可能なセキュリティの脆弱性により、リモート サーバーの接続が終了されました","The remote server's SSH configuration may have TCP forwarding disabled":"リモート サーバーの SSH 構成で TCP 転送が無効になっている可能性があります","URL must include the scheme ({0} or {1})":"URL にはスキーム ({0} または {1}) を含める必要があります","URL should not contain non-URL characters":"URL に URL 文字以外の文字を含めることはできません","Unsupported script type. Provide a .ps1 script on Windows.":"Unsupported script type. Provide a .ps1 script on Windows.","Update VS Code and try again later":"VS Code を更新して、後でもう一度お試しください","Update the remote.SSH.preconnect setting":"Update the remote.SSH.preconnect setting","View the Output Log to see mitigation steps provided by the VS Code Server":"出力ログを表示して、VS Code サーバーにより提供される軽減策の手順を確認してください","Waiting for other windows to connect":"他のウィンドウの接続を待機しています","Waiting for port forwarding to be ready":"ポート転送の準備ができるまで待機しています","When first establishing a connection to the remote server, various resources must be installed from the internet. A program (either \"wget\" or \"curl\") is used to download these resources, but they are not installed on the remote server.  When this step fails, the extension attempts to use the local machine to download the resources and then upload them to the remote server.":"リモート サーバーへの接続を最初に確立する際には、インターネットからさまざまなリソースをインストールする必要があります。これらのリソースをダウンロードするために \"wget\" または \"curl\" というプログラムが使用されますが、リモート サーバーにはこれらがインストールされていません。この手順が失敗すると、拡張機能はローカル コンピューターを使用してリソースをダウンロードし、リモート サーバーにアップロードしようとします。","Windows hosts are only supported on VS Code Insiders":"Windows ホストは VS Code Insider でのみサポートされています","Windows remotes do not support local bootstrap":"Windows リモートはローカル ブートストラップをサポートしていません","about SSH configuration files":"SSH 構成ファイルについて","bash not found":"Bash が見つかりません","click on an issue to continue in Copilot Chat.":"Copilot チャットで続行するには、問題をクリックします。","https://aka.ms/vscode-remote/faq/old-linux":"https://aka.ms/vscode-remote/faq/old-linux","specify a custom configuration file":"カスタム構成ファイルを指定する","{0} Add New SSH Host...":"{0} 新規 SSH ホストを追加する...","{1} is not a valid host to bind":"{1} はバインドする有効なホストではありません"}
