{"\"{0}\" has fingerprint \"{1}\".":"\"{0}\" tem impressão digital \"{1}\".","'{0}' will be executed on your local machine.":"\"{0}\" será executado no seu computador local.","A VS Code Server matching your local installation could not be downloaded from the internet.":"Não foi possível baixar da internet um Servidor do VS Code que corresponda à sua instalação local.","A command required on the remote machine was not found":"Um comando necessário no computador remoto não foi encontrado","Add the setting '{0}' to the server's '{1}' (or similar) configuration file":"Adicione a configuração '{0}' ao arquivo de configuração '{1}' (ou similar) do servidor","After logging into Copilot Chat, return here to continue diagnosing your connection issue.":"Depois de fazer logon no Chat do Copilot, volte aqui para continuar diagnosticando seu problema de conexão.","Allow":"Permitir","Allow and Don't Ask Again":"Permitir e Não Perguntar Novamente","An SSH installation couldn't be found":"Não foi possível encontrar uma instalação SSH","An error occurred while parsing the local SSH configuration file":"Ocorreu um erro ao analisar o arquivo de configuração do SSH local","Analyzing your previous SSH session logs...":"Analyzing your previous SSH session logs...","Are you sure you want to continue connecting?":"Tem certeza de que deseja continuar a se conectar?","Are you sure you want to continue?":"Tem certeza de que deseja continuar?","Can't assign requested address":"Não é possível atribuir o endereço solicitado","Cancel":"Cancelar","Change value of setting {0} to '{1}'":"Altere o valor da configuração {0} para '{1}'","Chat with {0}":"Conversar com {0}","Check proxy settings on local machine":"Verifique as configurações de proxy no computador local","Check the Remote - SSH log for output from the script (prefixed with {0})":"Check the Remote - SSH log for output from the script (prefixed with {0})","Checking VS Code Server status failed - please install either curl or wget on the remote.":"Falha na verificação do status do Servidor do VS Code - instale curl ou wget no controle remoto.","Client-side server download failed":"Falha no download do servidor do lado do cliente","Close Remote":"Fechar Remoto","Config file to save in":"Arquivo de configuração para salvar","Configure SSH Hosts...":"Configurar Hosts SSH...","Connect":"Conectar","Connect to VS Code Server - retry {0}":"Conectar-se ao Servidor do VS Code - tente novamente {0}","Connecting was canceled":"A conexão foi cancelada","Continue":"Continuar","Copying VS Code Server to host with scp":"Copiando o Servidor do VS Code para hospedar com scp","Could not establish connection to \"{0}\"":"Falha ao estabelecer conexão com \"{0}\"","Could not establish connection to \"{0}\": {1}":"Falha ao estabelecer conexão com \"{0}\": {1}","Could not resolve hostname":"Não foi possível resolver o nome do host","Delete the setting for this host to use the default path in the user home directory":"Exclua a configuração desse host para usar o caminho padrão no diretório base do usuário","Detected Windows host, need to reconnect":"Host do Windows detectado, precisa se reconectar","Diagnose with Copilot":"Diagnosticar com o Copilot","Disable {0}":"Desabilitar {0}","Discuss Remote - SSH related topics and diagnose connection issues with Copilot.  Recent connection logs will be shared with Copilot as chat context.":"Discuta tópicos remotos - relacionados a SSH e diagnoscie problemas de conexão com o Copilot.  Os logs de conexão recentes serão compartilhados com o Copilot como contexto de chat.","Do not use variables, double quotes, or other non-path characters when setting {0}":"Não use variáveis, aspas duplas ou outros caracteres que não sejam de caminho ao definir {0}","Don't Show Again":"Não Mostrar Novamente","Download the correct VS Code that corresponds both to your local installation and the remote architecture":"Baixe o VS Code correto que corresponde tanto à sua instalação local quanto à arquitetura remota","Downloading VS Code Server":"Baixando Servidor do VS Code","Downloading VS Code Server failed - please install either curl or wget on the remote.":"Falha no download do Servidor do VS Code - instale curl ou wget no controle remoto.","Downloading VS Code Server failed. Please try again later.":"Falha ao baixar o Servidor do VS Code. Tente novamente mais tarde.","Downloading VS Code Server locally":"Baixando o Servidor do VS Code localmente","Downloading VS Code Server...":"Baixando Servidor de Código VS...","ERROR: TCP port forwarding appears to be disabled on the remote host. Ensure that the sshd_config has `AllowTcpForwarding yes`. Contact your system administrator if needed.":"ERRO: o encaminhamento da porta TCP parece estar desabilitado no host remoto. Certifique-se de que sshd_config tenha “AllowTcpForwarding yes”. Entre em contato com o administrador do sistema, se necessário.","Edit custom SSH configuration file":"Editar arquivo de configuração SSH personalizado","Edit setting {0} to an absolute path on the remote server":"Edite a configuração {0} para um caminho absoluto no servidor remoto","Enable {0} to allow VS Code to download the required resources locally":"Habilite {0} para permitir que o VS Code baixe os recursos necessários localmente","Enable {0} to allow VS Code to download the required resources via your local machine and then upload them to the remote server":"Habilite {0} para permitir que o VS Code baixe os recursos necessários por meio do computador local e, em seguida, faça o upload para o servidor remoto","Ensure '{0}' operates between local and remote machines":"Verifique se '{0}' opera entre computadores locais e remotos","Ensure curl/wget are on the remote system's '{0}'":"Verifique se o curl/wget está no '{0}' do sistema remoto","Ensure that the parent directory exists":"Verifique se o diretório pai existe","Ensure that the remote server has internet access and has access to the VS Code CDN":"Verifique se o servidor remoto tem acesso à internet e à CDN do VS Code","Ensure that the remote server has internet access and that the network is not blocking the download":"Verifique se o servidor remoto tem acesso à internet e se a rede não está bloqueando o download","Ensure that the remote user has write permissions to the parent directory":"Verifique se o usuário remoto tem permissões de gravação no diretório pai","Ensure that the {0} setting correctly reflects the remote platform. Ensure no wildcard entry is being selected erroneously":"Verifique se a configuração {0} reflete corretamente a plataforma remota. Verifique se nenhuma entrada curinga está sendo selecionada erroneamente","Ensure the provide path is an absolute path":"Verifique se o caminho fornecido é um caminho absoluto","Ensure the provided path is executable and the script exits successfully (exit code 0)":"Ensure the provided path is executable and the script exits successfully (exit code 0)","Ensure the remote machine is configured to receive incoming connections on the local network":"Verifique se o computador remoto está configurado para receber conexões recebidas na rede local","Ensure there is sufficient free disk space on the remote machine":"Verifique se há espaço em disco gratuito suficiente no computador remoto","Ensure this program is installed on the remote machine and accessible via the '{0}' environment variable":"Verifique se esse programa está instalado no computador remoto e acessível por meio da variável de ambiente '{0}'","Enter SSH Connection Command":"Inserir Comando de Conexão SSH","Enter passphrase for ssh key {0}":"Inserir a frase secreta para a chave ssh {0}","Enter password":"Inserir senha","Enter password for {0}":"Inserir a senha para {0}","Error establishing tunnel ({0}).":"Erro ao estabelecer túnel ({0}).","Execute pre-connection script?":"Execute pre-connection script?","Expected tarball at local path {0}":"Arquivo tar esperado no caminho local {0}","Failed to create the remote server's install directory":"Falha ao criar o diretório de instalação do servidor remoto","Failed to download VS Code Server ({0})":"Falha ao fazer download do Servidor do VS Code ({0})","Failed to download VS Code Server locally":"Falha ao baixar o Servidor do VS Code localmente","Failed to find a free local port: {0}":"Falha ao localizar uma porta local livre: {0}","Failed to find a non-Windows SSH installed. Password prompts may not be displayed properly! Disable `remote.SSH.useLocalServer` if needed./{Locked=\"`remote.SSH.useLocalServer`\"}Do not translate `remote.SSH.useLocalServer`, it is a VS Code command.":"Falha ao localizar um SSH não Windows instalado. Os prompts de senha podem não ser exibidos corretamente! Desabilitar `remote.SSH.useLocalServer`, se necessário.","Failed to install the VS Code Server":"Falha ao instalar o Servidor do VS Code","Failed to kill VS Code Server on {0}.":"Falha ao encerrar o Servidor do VS Code em {0}.","Help":"Ajuda","Host added!":"Host adicionado!","Hostname contains invalid characters":"O nome do host contém caracteres inválidos","If your remote server is behind a firewall, ask your IT department to allow access to the VS Code CDN":"Se o servidor remoto estiver atrás de um firewall, peça ao departamento de TI para permitir o acesso à CDN do VS Code","If your remote server is behind a proxy, provide the proxy URL with setting '{0}' or '{1}'":"Se o servidor remoto estiver atrás de um proxy, forneça a URL do proxy com a configuração '{0}' ou '{1}'","Initializing VS Code Server":"Inicializando VS Code Server","Install '{0}' on the remote server. Installation steps will vary per distribution.":"Instale '{0}' no servidor remoto. As etapas de instalação variam conforme a distribuição.","Installing VS Code Server":"Instalando o Servidor do VS Code","Killed VS Code Server on {0}.":"Servidor do VS Code encerrado no {0}.","Learn More":"Saiba Mais","Local bootstrap of the VS Code Server failed.  This is an advanced feature for use in environments with limited internet acccess.":"A inicialização local do Servidor do VS Code falhou.  Esse é um recurso avançado para uso em ambientes com acesso limitado à internet.","Local download mode is configured as 'manual-bootstrap'. Exec server mode will be disabled.'":"O modo de download local está configurado como 'inicialização manual'. O modo de servidor Exec será desabilitado.'","Max wait time exhausted":"Tempo máximo de espera esgotado","Message":"Mensagem","Mitigations":"Atenuações","More Actions...":"Mais Ações...","More Info":"Mais Informações","Network is unreachable":"A rede está inacessível","No free ports in specified range '{0}-{1}'.  Remove or update the 'Preferred Local Port Range' setting and try again.":"Não há portas livres no intervalo especificado '{0}-{1}'.  Remova ou atualize a configuração de \"Intervalo de Porta Local Preferencial\" e tente novamente.","No route found to remote machine with a local IPv4 address.":"Nenhuma rota encontrada para o computador remoto com um endereço IPv4 local.","No route to host":"Sem rota para hospedar","On Mac OS, grant VS Code the 'Local Network' permission in System Settings":"No Mac OS, conceda ao VS Code a permissão de 'Rede Local' nas Configurações do Sistema","Open Config":"Abrir Configuração","Open Documentation":"Abrir a Documentação","Open Logs":"Abrir registros","Open Recent...":"Abrir Recentes...","Open SSH Configuration File":"Abrir Arquivo de Configuração SSH","Open Settings":"Abrir as Configurações","Pick an action to help resolve the problem.":"Escolha uma ação para ajudar a resolver o problema.","Place the VS Code Server in the bootstrap location specified in settings":"Coloque o Servidor do VS Code no local de inicialização especificado nas configurações","Port forwarding is disabled":"O encaminhamento de porta está desabilitado","Pre-connection script has changed since last confirmation":"Pre-connection script has changed since last confirmation","Proxy URL in settings is invalid":"A URL do proxy nas configurações é inválida","Received 407 from the server":"Recebeu 407 do servidor","Remote host key has changed, port forwarding is disabled":"A chave do host remoto foi alterada, o encaminhamento de porta está desabilitado","Remove or edit setting {0}":"Remova ou edite a configuração {0}","Remove this value from settings or correct the URL":"Remova esse valor das configurações ou corrija a URL","Report this issue with an example configuration file":"Relate esse problema com um exemplo de arquivo de configuração","Resources":"Recursos","Restart the SSH server on the remote machine to apply any changes to the configuration":"Reinicie o servidor SSH no computador remoto para aplicar alterações à configuração","Retry":"Repetir","Running pre-connection script ({0})":"Running pre-connection script ({0})","SSH host name cannot begin with {0}":"O nome do host SSH não pode começar com {0}","SSH host name cannot include the character {0}":"O nome do host SSH não pode incluir o caractere {0}","SSH user name cannot begin with {0}":"O nome de usuário SSH não pode começar com {0}","SSH user name cannot include the character {0}":"O nome de usuário SSH não pode incluir o caractere {0}","Search '{0}' in settings":"Pesquise '{0}' nas configurações","See output log for server installation URL":"Consulte o log de saída para ver a URL de instalação do servidor","See verbose information in the":"Veja informações detalhadas no","Select SSH configuration file to update":"Selecione o arquivo de configuração SSH a ser atualizado","Select configured SSH host or enter user@host/Translate user@host such that both user and host are translated but joined by an \"@\" sign.":"Selecione o host SSH configurado ou digite user@host","Set '{0}' in VS Code settings to use the correct proxy":"Defina '{0}' nas configurações do VS Code para usar o proxy correto","Setting up SSH Host {0}":"Configurando o Host SSH {0}","Setting up SSH tunnel":"Configurando o túnel SSH","Settings":"Configurações","Show details in terminal":"Mostrar detalhes no terminal","Skip":"Ignorar","Status":"Status","The VS Code Server failed to start":"O Servidor do VS Code falhou ao iniciar","The VS Code Server terminated due to presence of CVE-2020-1416. Check the Remote-SSH output channel for more details.":"O Servidor do VS Code foi encerrado devido à presença de CVE-2020-1416. Verifique o canal de saída Remote-SSH para obter mais detalhes.","The connection timed out":"O tempo limite da conexão foi atingido","The following issues were detected in your most recent Remote - SSH session":"Os problemas a seguir foram detectados em sua sessão mais recente de Remote – SSH","The install directory on the remote host could not be created. By default this is the '{0}' directory and can be overridden with the setting {1}":"O diretório de instalação no host remoto não pôde ser criado. Por padrão, esse é o diretório '{0}' e pode ser substituído pela configuração {1}","The operation timed out":"A operação atingiu o tempo limite","The pre-connect script has failed":"Falha no script de pré-conexão","The process tried to write to a nonexistent pipe":"O processo tentou gravar em um pipe inexistente","The provided custom server path is invalid":"O caminho do servidor personalizado fornecido é inválido","The remote host does not meet the prerequisites for running VS Code Server":"O host remoto não atende aos pré-requisitos para executar o VS Code Server","The remote host may not meet VS Code Server's prerequisites for glibc and libstdc++":"O host remoto pode não atender aos pré-requisitos do Servidor do VS Code para glibc e libstdc++","The remote host's architecture is not supported":"Não há suporte para a arquitetura do host remoto","The remote host's architecture is only supported on VS Code Insiders":"A arquitetura do host remoto é compatível apenas com VS Code Insiders","The remote host's platform is not supported":"Não há suporte para a plataforma do host remoto","The remote server has terminated the connection due to a known and preventable security vulnerability":"O servidor remoto encerrou a conexão devido a uma vulnerabilidade de segurança conhecida e evitável","The remote server's SSH configuration may have TCP forwarding disabled":"A configuração do SSH do servidor remoto pode ter o encaminhamento TCP desabilitado","URL must include the scheme ({0} or {1})":"A URL deve incluir o esquema ({0} ou {1})","URL should not contain non-URL characters":"A URL não deve conter caracteres que não sejam de URL","Unsupported script type. Provide a .ps1 script on Windows.":"Tipo de script sem suporte. Forneça um script .ps1 no Windows.","Update VS Code and try again later":"Atualize o VS Code e tente novamente mais tarde","Update the remote.SSH.preconnect setting":"Atualize a configuração remote.SSH.preconnect","View the Output Log to see mitigation steps provided by the VS Code Server":"Exiba o Log de Saída para ver as etapas de mitigação fornecidas pelo Servidor do VS Code","Waiting for other windows to connect":"Aguardando a conexão de outras janelas","Waiting for port forwarding to be ready":"Aguardando o encaminhamento de porta estar pronto","When first establishing a connection to the remote server, various resources must be installed from the internet. A program (either \"wget\" or \"curl\") is used to download these resources, but they are not installed on the remote server.  When this step fails, the extension attempts to use the local machine to download the resources and then upload them to the remote server.":"Ao estabelecer uma conexão com o servidor remoto pela primeira vez, vários recursos devem ser instalados da internet. Um programa (\"wget\" ou \"curl\") é usado para baixar esses recursos, mas não está instalado no servidor remoto.  Quando essa etapa falha, a extensão tenta usar o computador local para baixar os recursos e, em seguida, carregá-los no servidor remoto.","Windows hosts are only supported on VS Code Insiders":"Os hosts do Windows são compatíveis apenas com VS Code Insiders","Windows remotes do not support local bootstrap":"Os Remotos do Windows não dão suporte à inicialização local","about SSH configuration files":"sobre arquivos de configuração SSH","bash not found":"bash não encontrado","click on an issue to continue in Copilot Chat.":"clique em um problema para continuar no Chat do Copilot.","https://aka.ms/vscode-remote/faq/old-linux":"https://aka.ms/vscode-remote/faq/old-linux","specify a custom configuration file":"especificar um arquivo de configuração personalizado","{0} Add New SSH Host...":"{0} Adicionar Novo Host SSH...","{1} is not a valid host to bind":"{1} não é um host válido para associar"}
