{"\"{0}\" has fingerprint \"{1}\".":"\"{0}\" ha l'impronta digitale \"{1}\".","'{0}' will be executed on your local machine.":"'{0}' will be executed on your local machine.","A VS Code Server matching your local installation could not be downloaded from the internet.":"Non è stato possibile scaricare da Internet un server VS Code corrispondente all'installazione locale.","A command required on the remote machine was not found":"Non è stato trovato un comando necessario sul computer remoto","Add the setting '{0}' to the server's '{1}' (or similar) configuration file":"Aggiungi l'impostazione '{0}' al file di configurazione del server '{1}' (o simile)","After logging into Copilot Chat, return here to continue diagnosing your connection issue.":"Dopo aver eseguito l'accesso alla chat di Copilot, tornare qui per continuare a diagnosticare il problema di connessione.","Allow":"Consenti","Allow and Don't Ask Again":"Allow and Don't Ask Again","An SSH installation couldn't be found":"Non è stato possibile trovare un'installazione SSH","An error occurred while parsing the local SSH configuration file":"Si è verificato un errore durante l'analisi del file di configurazione SSH locale","Analyzing your previous SSH session logs...":"Analyzing your previous SSH session logs...","Are you sure you want to continue connecting?":"Continuare la connessione?","Are you sure you want to continue?":"Continuare?","Can't assign requested address":"Non è possibile assegnare l'indirizzo richiesto","Cancel":"Annulla","Change value of setting {0} to '{1}'":"Cambia il valore dell'impostazione {0} in '{1}'","Chat with {0}":"Chatta con {0}","Check proxy settings on local machine":"Controlla le impostazioni del proxy sul computer locale","Check the Remote - SSH log for output from the script (prefixed with {0})":"Check the Remote - SSH log for output from the script (prefixed with {0})","Checking VS Code Server status failed - please install either curl or wget on the remote.":"Il controllo dello stato di VS Code Server non è riuscito. Installare curl o wget nel computer remoto.","Client-side server download failed":"Download del server sul lato client non riuscito","Close Remote":"Chiudere remoto","Config file to save in":"File di configurazione da salvare in","Configure SSH Hosts...":"Configura host SSH...","Connect":"Connetti","Connect to VS Code Server - retry {0}":"Connettersi al server VS Code - Riprovare {0}","Connecting was canceled":"La connessione è stata annullata","Continue":"Continua","Copying VS Code Server to host with scp":"Copia del server VS Code nell'host con scp in corso","Could not establish connection to \"{0}\"":"Non è stato possibile stabilire la connessione a \"{0}\"","Could not establish connection to \"{0}\": {1}":"Impossibile stabilire la connessione a \"{0}\": {1}","Could not resolve hostname":"Non è stato possibile risolvere il nome host","Delete the setting for this host to use the default path in the user home directory":"Elimina l'impostazione per questo host per usare il percorso predefinito nella directory home dell'utente","Detected Windows host, need to reconnect":"Rilevato host Windows. È necessario riconnettersi","Diagnose with Copilot":"Diagnostica con Copilot","Disable {0}":"Disabilita {0}","Discuss Remote - SSH related topics and diagnose connection issues with Copilot.  Recent connection logs will be shared with Copilot as chat context.":"Discuti gli argomenti relativi a SSH remoto e diagnostica i problemi di connessione con Copilot.  I log di connessione recenti verranno condivisi con Copilot come contesto della chat.","Do not use variables, double quotes, or other non-path characters when setting {0}":"Non usare variabili, virgolette doppie o altri caratteri non di percorso quando si imposta {0}","Don't Show Again":"Non visualizzare più questo messaggio","Download the correct VS Code that corresponds both to your local installation and the remote architecture":"Scarica il VS Code corretto che corrisponde sia all'installazione locale che all'architettura remota","Downloading VS Code Server":"Download del server VS Code in corso","Downloading VS Code Server failed - please install either curl or wget on the remote.":"Il download di VS Code Server non è riuscito. Installare curl o wget nel computer remoto.","Downloading VS Code Server failed. Please try again later.":"Download di VS Code Server non riuscito. Riprovare più tardi.","Downloading VS Code Server locally":"Download del server VS Code in locale in corso","Downloading VS Code Server...":"Download di VS Code Server in corso...","ERROR: TCP port forwarding appears to be disabled on the remote host. Ensure that the sshd_config has `AllowTcpForwarding yes`. Contact your system administrator if needed.":"ERRORE: l'inoltro della porta TCP risulta disabilitata nell'host remoto. Assicurarsi che il sshd_config disponga di `AllowTcpForwarding yes`. Se necessario, contattare l'amministratore di sistema.","Edit custom SSH configuration file":"Modificare il file di configurazione SSH personalizzato","Edit setting {0} to an absolute path on the remote server":"Modifica l'impostazione {0} su un percorso assoluto nel server remoto","Enable {0} to allow VS Code to download the required resources locally":"Abilitare {0} per consentire a VS Code di scaricare localmente le risorse necessarie","Enable {0} to allow VS Code to download the required resources via your local machine and then upload them to the remote server":"Abilitar {0} per consentire a VS Code di scaricare le risorse necessarie tramite il computer locale e quindi caricarle nel server remoto","Ensure '{0}' operates between local and remote machines":"Assicurati che '{0}' funzioni tra computer locali e remoti","Ensure curl/wget are on the remote system's '{0}'":"Assicurati che curl/wget si trovino nel '{0}' del sistema remoto","Ensure that the parent directory exists":"Assicurati che la directory padre esista","Ensure that the remote server has internet access and has access to the VS Code CDN":"Assicurati che il server remoto disponga dell'accesso a Internet e possa accedere alla rete CDN di VS Code","Ensure that the remote server has internet access and that the network is not blocking the download":"Assicurati che il server remoto abbia accesso a Internet e che la rete non blocchi il download","Ensure that the remote user has write permissions to the parent directory":"Assicurati che l'utente remoto disponga delle autorizzazioni di scrittura nella directory padre","Ensure that the {0} setting correctly reflects the remote platform. Ensure no wildcard entry is being selected erroneously":"Assicurati che l'impostazione {0} rispecchi correttamente la piattaforma remota. Assicurati che non venga selezionata erroneamente alcuna voce con caratteri jolly","Ensure the provide path is an absolute path":"Assicurati che il percorso specificato sia un percorso assoluto","Ensure the provided path is executable and the script exits successfully (exit code 0)":"Ensure the provided path is executable and the script exits successfully (exit code 0)","Ensure the remote machine is configured to receive incoming connections on the local network":"Assicurati che il computer remoto sia configurato per ricevere connessioni in ingresso nella rete locale","Ensure there is sufficient free disk space on the remote machine":"Assicurati che lo spazio disponibile su disco nel computer remoto sia sufficiente","Ensure this program is installed on the remote machine and accessible via the '{0}' environment variable":"Assicurati che questo programma sia installato sulla macchina remota e sia accessibile tramite la variabile di ambiente '{0}'","Enter SSH Connection Command":"Immettere il comando di connessione SSH","Enter passphrase for ssh key {0}":"Immettere la passphrase per la chiave SSH {0}","Enter password":"Immetti la password","Enter password for {0}":"Immettere la password per {0}","Error establishing tunnel ({0}).":"Errore durante la creazione del tunnel ({0}).","Execute pre-connection script?":"Execute pre-connection script?","Expected tarball at local path {0}":"Tarball previsto nel percorso locale {0}","Failed to create the remote server's install directory":"Impossibile creare la directory di installazione del server remoto","Failed to download VS Code Server ({0})":"Non è stato possibile eseguire il download del server VS Code ({0})","Failed to download VS Code Server locally":"Non è stato possibile eseguire il download del server VS Code in locale","Failed to find a free local port: {0}":"Impossibile trovare una porta locale disponibile: {0}","Failed to find a non-Windows SSH installed. Password prompts may not be displayed properly! Disable `remote.SSH.useLocalServer` if needed./{Locked=\"`remote.SSH.useLocalServer`\"}Do not translate `remote.SSH.useLocalServer`, it is a VS Code command.":"Non è stato possibile trovare un SSH non Windows installato. Le richieste di password potrebbero non essere visualizzate correttamente. Disabilitare `remote.SSH.useLocalServer` se necessario.","Failed to install the VS Code Server":"Non è stato possibile installare il server VS Code","Failed to kill VS Code Server on {0}.":"Non è stato possibile terminare il server VS Code in {0}.","Help":"Guida","Host added!":"Host aggiunto.","Hostname contains invalid characters":"Il nome host contiene caratteri non validi","If your remote server is behind a firewall, ask your IT department to allow access to the VS Code CDN":"Se il server remoto è protetto da un firewall, chiedi al reparto IT di consentire l'accesso alla rete CDN di VS Code","If your remote server is behind a proxy, provide the proxy URL with setting '{0}' or '{1}'":"Se il server remoto è protetto da un proxy, specifica l'URL del proxy con l'impostazione '{0}' o '{1}'","Initializing VS Code Server":"Inizializzazione del server VS Code","Install '{0}' on the remote server. Installation steps will vary per distribution.":"Installare '{0}' nel server remoto. I passaggi di installazione variano in base alla distribuzione.","Installing VS Code Server":"Installazione del server VS Code","Killed VS Code Server on {0}.":"Server VS Code terminato in {0}.","Learn More":"Scopri di più","Local bootstrap of the VS Code Server failed.  This is an advanced feature for use in environments with limited internet acccess.":"Il bootstrap locale del server VS Code non è riuscito.  Questa è una funzionalità avanzata da usare in ambienti con accesso a Internet limitato.","Local download mode is configured as 'manual-bootstrap'. Exec server mode will be disabled.'":"La modalità di download locale è configurata come 'manual-bootstrap'. La modalità server Exec verrà disabilitata.'","Max wait time exhausted":"Tempo di attesa massimo esaurito","Message":"Messaggio","Mitigations":"Mitigazioni","More Actions...":"Altre azioni...","More Info":"Altre informazioni","Network is unreachable":"La rete non è raggiungibile","No free ports in specified range '{0}-{1}'.  Remove or update the 'Preferred Local Port Range' setting and try again.":"Nessuna porta libera nell'intervallo specificato '{0}-{1}'.  Rimuovere o aggiornare l'impostazione 'Intervallo di porte locali preferite' e riprovare.","No route found to remote machine with a local IPv4 address.":"Nessun percorso trovato al computer remoto con un indirizzo IPv4 locale.","No route to host":"Nessuna route all'host","On Mac OS, grant VS Code the 'Local Network' permission in System Settings":"In macOS, concedi a VS Code l'autorizzazione 'Rete locale' nelle Impostazioni di sistema","Open Config":"Apri configurazione","Open Documentation":"Apri documentazione","Open Logs":"Apri log","Open Recent...":"Aprire recenti...","Open SSH Configuration File":"Apri file di configurazione SSH","Open Settings":"Apri impostazioni","Pick an action to help resolve the problem.":"Selezionare un'azione per risolvere il problema.","Place the VS Code Server in the bootstrap location specified in settings":"Posiziona il server VS Code nel percorso di bootstrap specificato nelle impostazioni","Port forwarding is disabled":"Port forwarding è disabilitato","Pre-connection script has changed since last confirmation":"Pre-connection script has changed since last confirmation","Proxy URL in settings is invalid":"L'URL del proxy nelle impostazioni non è valido","Received 407 from the server":"Errore 407 ricevuto dal server","Remote host key has changed, port forwarding is disabled":"La chiave host remoto è stata modificata, port forwarding è disabilitata","Remove or edit setting {0}":"Rimuovi o modifica l'impostazione {0}","Remove this value from settings or correct the URL":"Rimuovi questo valore dalle impostazioni o correggi l'URL","Report this issue with an example configuration file":"Segnala questo problema con un file di configurazione di esempio","Resources":"Risorse","Restart the SSH server on the remote machine to apply any changes to the configuration":"Riavvia il server SSH sulla macchina remota per applicare eventuali modifiche alla configurazione","Retry":"Riprova","Running pre-connection script ({0})":"Running pre-connection script ({0})","SSH host name cannot begin with {0}":"Il nome host SSH non può iniziare con {0}","SSH host name cannot include the character {0}":"Il nome host SSH non può includere il carattere {0}","SSH user name cannot begin with {0}":"Il nome utente SSH non può iniziare con {0}","SSH user name cannot include the character {0}":"Il nome utente SSH non può includere il carattere {0}","Search '{0}' in settings":"Cerca '{0}' nelle impostazioni","See output log for server installation URL":"Vedi il log di output per l'URL di installazione del server","See verbose information in the":"Vedere le informazioni dettagliate in","Select SSH configuration file to update":"Selezionare il file di configurazione SSH da aggiornare","Select configured SSH host or enter user@host/Translate user@host such that both user and host are translated but joined by an \"@\" sign.":"Selezionare l'host SSH configurato o immettere utente@host","Set '{0}' in VS Code settings to use the correct proxy":"Imposta '{0}' nelle impostazioni di VS Code per usare il proxy corretto","Setting up SSH Host {0}":"Configurazione dell'host SSH {0}","Setting up SSH tunnel":"Configurazione del tunnel SSH","Settings":"Impostazioni","Show details in terminal":"Mostra dettagli nel terminale","Skip":"Ignora","Status":"Stato","The VS Code Server failed to start":"Non è stato possibile avviare il server di VS Code.","The VS Code Server terminated due to presence of CVE-2020-1416. Check the Remote-SSH output channel for more details.":"Server VS Code terminato a causa della presenza di CVE-2020-1416. Per ulteriori dettagli, controllare il canale di output SSH remoto.","The connection timed out":"Timeout della connessione.","The following issues were detected in your most recent Remote - SSH session":"Sono stati rilevati i problemi seguenti nella sessione SSH remota più recente","The install directory on the remote host could not be created. By default this is the '{0}' directory and can be overridden with the setting {1}":"Non è stato possibile creare la directory di installazione nell'host remoto. Per impostazione predefinita, questa è la directory '{0}' e può essere sovrascritta con l'impostazione {1}","The operation timed out":"Timeout dell'operazione.","The pre-connect script has failed":"The pre-connect script has failed","The process tried to write to a nonexistent pipe":"Il processo ha tentato di scrivere in una pipe inesistente","The provided custom server path is invalid":"Il percorso specificato per il server personalizzato non è valido","The remote host does not meet the prerequisites for running VS Code Server":"L'host remoto non soddisfa i prerequisiti per l'esecuzione di VS Code Server","The remote host may not meet VS Code Server's prerequisites for glibc and libstdc++":"L'host remoto potrebbe non soddisfare i prerequisiti del server VS Code per glibc e libstdc++","The remote host's architecture is not supported":"L'architettura dell'host remoto non è supportata","The remote host's architecture is only supported on VS Code Insiders":"L'architettura dell'host remoto è supportata solo in VS Code Insider","The remote host's platform is not supported":"La piattaforma dell'host remoto non è supportata","The remote server has terminated the connection due to a known and preventable security vulnerability":"Il server remoto ha interrotto la connessione a causa di una vulnerabilità di sicurezza nota e prevenibile","The remote server's SSH configuration may have TCP forwarding disabled":"L'inoltro TCP potrebbe essere disabilitato nella configurazione SSH del server remoto","URL must include the scheme ({0} or {1})":"L'URL deve includere lo schema ({0} o {1})","URL should not contain non-URL characters":"L'URL non deve contenere caratteri non URL","Unsupported script type. Provide a .ps1 script on Windows.":"Unsupported script type. Provide a .ps1 script on Windows.","Update VS Code and try again later":"Aggiorna VS Code e riprova più tardi","Update the remote.SSH.preconnect setting":"Update the remote.SSH.preconnect setting","View the Output Log to see mitigation steps provided by the VS Code Server":"Visualizza il log di output per vedere i passaggi di mitigazione forniti dal server VS Code","Waiting for other windows to connect":"In attesa della connessione di altre finestre","Waiting for port forwarding to be ready":"In attesa che port forwarding sia pronto","When first establishing a connection to the remote server, various resources must be installed from the internet. A program (either \"wget\" or \"curl\") is used to download these resources, but they are not installed on the remote server.  When this step fails, the extension attempts to use the local machine to download the resources and then upload them to the remote server.":"Quando si stabilisce prima una connessione al server remoto, è necessario installare varie risorse da Internet. Per scaricare queste risorse viene usato programma (\"wget\" o \"curl\"), ma tali risorse non vengono installate sul server remoto.  Quando questo passaggio non riesce, l'estensione tenta di utilizzare il computer locale per scaricare le risorse e poi caricarle sul server remoto.","Windows hosts are only supported on VS Code Insiders":"Windows host sono supportati solo in VS Code Insider","Windows remotes do not support local bootstrap":"I computer Windows remoti non supportano il bootstrap locale","about SSH configuration files":"sui file di configurazione SSH","bash not found":"bash non trovato","click on an issue to continue in Copilot Chat.":"fare clic su un problema per continuare nella chat di Copilot.","https://aka.ms/vscode-remote/faq/old-linux":"https://aka.ms/vscode-remote/faq/old-linux","specify a custom configuration file":"specificare un file di configurazione personalizzato","{0} Add New SSH Host...":"{0} aggiungi nuovo host SSH...","{1} is not a valid host to bind":"{1} non è un host valido da associare"}
