{"\"{0}\" has fingerprint \"{1}\".":"\"{0}\"에 \"{1}\" 지문이 있습니다.","'{0}' will be executed on your local machine.":"'{0}' will be executed on your local machine.","A VS Code Server matching your local installation could not be downloaded from the internet.":"로컬 설치와 일치하는 VS Code 서버를 인터넷에서 다운로드할 수 없습니다.","A command required on the remote machine was not found":"원격 컴퓨터에서 필요한 명령을 찾을 수 없습니다","Add the setting '{0}' to the server's '{1}' (or similar) configuration file":"'{0}' 설정을 서버의 '{1}'(또는 이와 유사한) 구성 파일에 추가하세요","After logging into Copilot Chat, return here to continue diagnosing your connection issue.":"Copilot 채팅에 로그인한 후 여기로 돌아와 연결 문제를 계속 진단하세요.","Allow":"허용","Allow and Don't Ask Again":"Allow and Don't Ask Again","An SSH installation couldn't be found":"SSH 설치를 찾을 수 없습니다.","An error occurred while parsing the local SSH configuration file":"로컬 SSH 구성 파일을 구문 분석하는 동안 오류가 발생했습니다","Analyzing your previous SSH session logs...":"Analyzing your previous SSH session logs...","Are you sure you want to continue connecting?":"연결을 계속 진행하시겠습니까?","Are you sure you want to continue?":"계속하시겠습니까?","Can't assign requested address":"요청한 주소를 할당할 수 없습니다","Cancel":"취소","Change value of setting {0} to '{1}'":"{0} 설정의 값을 '{1}'(으)로 변경하세요","Chat with {0}":"{0} 채팅","Check proxy settings on local machine":"로컬 컴퓨터의 프록시 설정을 확인하세요","Check the Remote - SSH log for output from the script (prefixed with {0})":"Check the Remote - SSH log for output from the script (prefixed with {0})","Checking VS Code Server status failed - please install either curl or wget on the remote.":"VS Code 서버 상태 확인 실패 - 원격에 curl 또는 wget을 설치하세요.","Client-side server download failed":"클라이언트 쪽 서버 다운로드 실패","Close Remote":"원격 닫기","Config file to save in":"다음에 저장할 구성 파일","Configure SSH Hosts...":"SSH 호스트 구성...","Connect":"연결","Connect to VS Code Server - retry {0}":"VS Code 서버에 연결 - {0} 다시 시도","Connecting was canceled":"연결을 취소했습니다.","Continue":"계속","Copying VS Code Server to host with scp":"scp를 사용하여 호스트에 VS Code 서버를 복사하는 중","Could not establish connection to \"{0}\"":"\"{0}\"에 연결할 수 없습니다.","Could not establish connection to \"{0}\": {1}":"\"{0}\"에 연결할 수 없음: {1}","Could not resolve hostname":"호스트 이름을 확인할 수 없습니다.","Delete the setting for this host to use the default path in the user home directory":"이 호스트의 설정을 삭제하여 사용자 홈 디렉터리에서 기본 경로를 사용하세요","Detected Windows host, need to reconnect":"Windows 호스트가 검색되었습니다. 다시 연결해야 합니다.","Diagnose with Copilot":"Copilot로 진단","Disable {0}":"{0}을(를) 비활성화하세요","Discuss Remote - SSH related topics and diagnose connection issues with Copilot.  Recent connection logs will be shared with Copilot as chat context.":"원격 - SSH 관련 topics 토론하고 Copilot와의 연결 문제를 진단합니다.  최근 연결 로그가 채팅 컨텍스트로 Copilot와 공유됩니다.","Do not use variables, double quotes, or other non-path characters when setting {0}":"{0}을(를) 설정할 때는 변수, 큰따옴표 또는 경로가 아닌 다른 문자를 사용하지 마세요.","Don't Show Again":"다시 표시 안 함","Download the correct VS Code that corresponds both to your local installation and the remote architecture":"로컬 설치와 원격 아키텍처 모두에 해당하는 올바른 VS Code를 다운로드하세요","Downloading VS Code Server":"VS Code 서버 다운로드 중","Downloading VS Code Server failed - please install either curl or wget on the remote.":"VS Code 서버를 다운로드하지 못했습니다. 원격에 curl 또는 wget을 설치하세요.","Downloading VS Code Server failed. Please try again later.":"VS Code 서버를 다운로드하지 못했습니다. 나중에 다시 시도하세요.","Downloading VS Code Server locally":"VS Code Server 로컬로 다운로드하는 중","Downloading VS Code Server...":"VS Code 서버 다운로드 중...","ERROR: TCP port forwarding appears to be disabled on the remote host. Ensure that the sshd_config has `AllowTcpForwarding yes`. Contact your system administrator if needed.":"오류: 원격 호스트에서 TCP 포트 전달을 사용할 수 없는 것 같습니다. sshd_config에 'AllowTcpForwarding yes'가 있는지 확인합니다. 필요한 경우 시스템 관리자에게 문의하세요.","Edit custom SSH configuration file":"사용자 지정 SSH 구성 파일 편집","Edit setting {0} to an absolute path on the remote server":"원격 서버의 절대 경로에 대한 {0} 설정을 편집하세요","Enable {0} to allow VS Code to download the required resources locally":"{0}을(를) 활성화하여 VS Code가 필요한 리소스를 로컬로 다운로드할 수 있도록 허용하세요.","Enable {0} to allow VS Code to download the required resources via your local machine and then upload them to the remote server":"{0}을(를) 활성화하여 VS Code가 로컬 컴퓨터를 통해 필요한 리소스를 다운로드한 다음 원격 서버에 업로드할 수 있도록 하세요","Ensure '{0}' operates between local and remote machines":"로컬 컴퓨터와 원격 컴퓨터 간에 '{0}'이(가) 작동하는지 확인하세요","Ensure curl/wget are on the remote system's '{0}'":"curl/wget이 원격 시스템의 '{0}'에 있는지 확인하세요","Ensure that the parent directory exists":"부모 디렉터리가 있는지 확인하세요","Ensure that the remote server has internet access and has access to the VS Code CDN":"원격 서버가 인터넷에 연결되어 있고, VS Code CDN에 액세스할 수 있는지 확인하세요.","Ensure that the remote server has internet access and that the network is not blocking the download":"원격 서버가 인터넷에 연결되어 있고, 네트워크에서 다운로드를 차단하고 있지 않은지 확인하세요","Ensure that the remote user has write permissions to the parent directory":"원격 사용자에게 부모 디렉터리에 대한 쓰기 권한이 있는지 확인하세요","Ensure that the {0} setting correctly reflects the remote platform. Ensure no wildcard entry is being selected erroneously":"{0} 설정에 원격 플랫폼이 제대로 반영되어 있는지 확인하세요. 와일드카드 항목을 잘못 선택하지 않는지 확인하세요","Ensure the provide path is an absolute path":"제공된 경로가 절대 경로인지 확인하세요","Ensure the provided path is executable and the script exits successfully (exit code 0)":"Ensure the provided path is executable and the script exits successfully (exit code 0)","Ensure the remote machine is configured to receive incoming connections on the local network":"로컬 네트워크에서 수신 연결을 받도록 원격 컴퓨터를 구성했는지 확인하세요.","Ensure there is sufficient free disk space on the remote machine":"원격 컴퓨터에 사용 가능한 디스크 공간이 충분한지 확인하세요","Ensure this program is installed on the remote machine and accessible via the '{0}' environment variable":"이 프로그램이 원격 컴퓨터에 설치되어 있고, '{0}' 환경 변수를 통해 액세스할 수 있는지 확인하세요","Enter SSH Connection Command":"SSH 연결 명령 입력","Enter passphrase for ssh key {0}":"{0} SSH 키 암호 입력","Enter password":"암호 입력","Enter password for {0}":"{0} 암호 입력","Error establishing tunnel ({0}).":"터널({0})을 설정하는 동안 오류가 발생했습니다.","Execute pre-connection script?":"Execute pre-connection script?","Expected tarball at local path {0}":"{0} 로컬 경로에 tarball이 필요합니다","Failed to create the remote server's install directory":"원격 서버의 설치 ​​디렉토리를 생성하지 못했습니다.","Failed to download VS Code Server ({0})":"VS Code 서버를 다운로드하지 못함({0})","Failed to download VS Code Server locally":"VS Code 서버를 로컬로 다운로드하지 못했습니다.","Failed to find a free local port: {0}":"여유 로컬 포트를 찾지 못했습니다: {0}","Failed to find a non-Windows SSH installed. Password prompts may not be displayed properly! Disable `remote.SSH.useLocalServer` if needed./{Locked=\"`remote.SSH.useLocalServer`\"}Do not translate `remote.SSH.useLocalServer`, it is a VS Code command.":"설치된 비 Windows SSH를 찾지 못했습니다. 암호 프롬프트가 제대로 표시되지 않을 수 있습니다. 필요한 경우 `remote.SSH.useLocalServer`를 비활성화하세요.","Failed to install the VS Code Server":"VS 코드 서버를 설치하지 못했습니다.","Failed to kill VS Code Server on {0}.":"{0}의 VS Code 서버를 종료하지 못했습니다.","Help":"도움말","Host added!":"호스트를 추가했습니다!","Hostname contains invalid characters":"호스트 이름에 잘못된 문자가 포함됨","If your remote server is behind a firewall, ask your IT department to allow access to the VS Code CDN":"원격 서버가 방화벽 뒤에 있는 경우 IT 부서에 VS Code CDN에 대한 액세스를 허용해 달라고 요청하세요","If your remote server is behind a proxy, provide the proxy URL with setting '{0}' or '{1}'":"원격 서버가 프록시 뒤에 있는 경우 '{0}' 또는 '{1}' 설정에 프록시 URL을 제공하세요","Initializing VS Code Server":"VS Code 서버를 초기화하는 중","Install '{0}' on the remote server. Installation steps will vary per distribution.":"원격 서버에 '{0}'을(를) 설치하세요. 설치 단계는 배포마다 다릅니다.","Installing VS Code Server":"VS Code 서버 설치 중","Killed VS Code Server on {0}.":"{0}의 VS Code 서버를 종료했습니다.","Learn More":"자세한 정보","Local bootstrap of the VS Code Server failed.  This is an advanced feature for use in environments with limited internet acccess.":"VS Code 서버의 로컬 부트스트랩이 실패했습니다.  인터넷 액세스가 제한된 환경에서 사용할 수 있는 고급 기능입니다.","Local download mode is configured as 'manual-bootstrap'. Exec server mode will be disabled.'":"로컬 다운로드 모드가 '수동-부트스트랩'으로 구성되어 있습니다. Exec 서버 모드가 비활성화됩니다.’","Max wait time exhausted":"최대 대기 시간 모두 사용","Message":"메시지","Mitigations":"완화","More Actions...":"기타 작업...","More Info":"기타 정보","Network is unreachable":"네트워크에 연결할 수 없습니다.","No free ports in specified range '{0}-{1}'.  Remove or update the 'Preferred Local Port Range' setting and try again.":"지정된 범위 '{0}-{1}'에 사용 가능한 포트가 없습니다.  '기본 설정 로컬 포트 범위' 설정을 제거하거나 업데이트한 후 다시 시도하세요.","No route found to remote machine with a local IPv4 address.":"로컬 IPv4 주소가 있는 원격 컴퓨터에 대한 경로를 찾을 수 없습니다.","No route to host":"호스트 경로가 없습니다","On Mac OS, grant VS Code the 'Local Network' permission in System Settings":"Mac OS 시스템 설정에서 VS Code에 '로컬 네트워크' 권한을 부여하세요","Open Config":"구성 열기","Open Documentation":"설명서 열기","Open Logs":"로그 열기","Open Recent...":"최근 항목 열기...","Open SSH Configuration File":"SSH 구성 파일 열기","Open Settings":"설정 열기","Pick an action to help resolve the problem.":"문제를 해결하는 데 도움이 되는 작업을 선택하세요.","Place the VS Code Server in the bootstrap location specified in settings":"설정에 지정된 부트스트랩 위치에 VS Code 서버를 배치하세요","Port forwarding is disabled":"포트 전달을 사용할 수 없습니다.","Pre-connection script has changed since last confirmation":"Pre-connection script has changed since last confirmation","Proxy URL in settings is invalid":"설정의 프록시 URL이 잘못되었습니다","Received 407 from the server":"서버에서 407 응답을 받았습니다","Remote host key has changed, port forwarding is disabled":"원격 호스트 키가 변경되었으며 포트 전달이 비활성화되었습니다.","Remove or edit setting {0}":"{0} 설정을 제거하거나 편집하세요","Remove this value from settings or correct the URL":"설정에서 이 값을 제거하거나 URL을 수정하세요","Report this issue with an example configuration file":"예제 구성 파일을 사용하여 이 문제를 보고하세요","Resources":"리소스","Restart the SSH server on the remote machine to apply any changes to the configuration":"구성에 변경 내용을 적용하려면 원격 컴퓨터에서 SSH 서버를 다시 시작하세요","Retry":"다시 시도","Running pre-connection script ({0})":"Running pre-connection script ({0})","SSH host name cannot begin with {0}":"SSH 호스트 이름은 {0}(으)로 시작할 수 없습니다.","SSH host name cannot include the character {0}":"SSH 호스트 이름은 {0} 문자를 포함할 수 없습니다.","SSH user name cannot begin with {0}":"SSH 사용자 이름은 {0}(으)로 시작할 수 없습니다.","SSH user name cannot include the character {0}":"SSH 사용자 이름은 {0} 문자를 포함할 수 없습니다.","Search '{0}' in settings":"설정에서 '{0}'을(를) 검색하세요","See output log for server installation URL":"서버 설치 URL의 출력 로그를 참조하세요","See verbose information in the":"자세한 내용은 다음에서 확인:","Select SSH configuration file to update":"업데이트할 SSH 구성 파일 선택","Select configured SSH host or enter user@host/Translate user@host such that both user and host are translated but joined by an \"@\" sign.":"구성된 SSH 호스트를 선택하거나 user@host 입력","Set '{0}' in VS Code settings to use the correct proxy":"올바른 프록시를 사용하도록 VS Code 설정에서 '{0}'을(를) 설정하세요","Setting up SSH Host {0}":"{0} SSH 호스트 설정","Setting up SSH tunnel":"SSH 터널 설정","Settings":"설정","Show details in terminal":"터미널에 세부 정보 표시","Skip":"건너뛰기","Status":"상태","The VS Code Server failed to start":"VS Code 서버를 시작하지 못했습니다.","The VS Code Server terminated due to presence of CVE-2020-1416. Check the Remote-SSH output channel for more details.":"CVE-2020-1416의 존재로 인해 VS Code 서버가 종료되었습니다. 자세한 내용은 Remote-SSH 출력 채널을 확인하세요.","The connection timed out":"연결 시간이 초과되었습니다.","The following issues were detected in your most recent Remote - SSH session":"최근 원격 - SSH 세션에서 다음 문제가 감지되었습니다.","The install directory on the remote host could not be created. By default this is the '{0}' directory and can be overridden with the setting {1}":"원격 호스트에 설치 디렉터리를 만들 수 없습니다. 기본적으로 이 디렉터리는 '{0}' 디렉터리이며, {1} 설정으로 재정의할 수 있습니다","The operation timed out":"작업 시간이 초과되었습니다.","The pre-connect script has failed":"The pre-connect script has failed","The process tried to write to a nonexistent pipe":"프로세스가 존재하지 않는 파이프에 쓰려고 했습니다.","The provided custom server path is invalid":"제공된 사용자 지정 서버 경로가 잘못되었습니다","The remote host does not meet the prerequisites for running VS Code Server":"원격 호스트가 VS Code Server를 실행하기 위한 필수 구성 요소를 충족하지 않습니다.","The remote host may not meet VS Code Server's prerequisites for glibc and libstdc++":"원격 호스트가 glibc 및 libstdc++에 대한 VS Code 서버의 필수 구성 요소를 충족하지 못할 수 있습니다.","The remote host's architecture is not supported":"원격 호스트의 아키텍처가 지원되지 않습니다.","The remote host's architecture is only supported on VS Code Insiders":"원격 호스트의 아키텍처는 VS Code Insider에서만 지원됩니다.","The remote host's platform is not supported":"원격 호스트의 플랫폼이 지원되지 않습니다.","The remote server has terminated the connection due to a known and preventable security vulnerability":"알려진 방지 가능한 보안 취약성으로 인해 원격 서버가 연결을 종료했습니다","The remote server's SSH configuration may have TCP forwarding disabled":"원격 서버의 SSH 구성에서 TCP 전달이 비활성화되었을 수 있습니다","URL must include the scheme ({0} or {1})":"URL은 체계({0} 또는 {1})를 포함해야 합니다","URL should not contain non-URL characters":"URL에 URL이 아닌 문자를 포함할 수 없습니다","Unsupported script type. Provide a .ps1 script on Windows.":"Unsupported script type. Provide a .ps1 script on Windows.","Update VS Code and try again later":"VS Code를 업데이트하고 나중에 다시 시도하세요","Update the remote.SSH.preconnect setting":"Update the remote.SSH.preconnect setting","View the Output Log to see mitigation steps provided by the VS Code Server":"출력 로그를 확인하여 VS Code 서버에서 제공하는 완화 단계를 확인하세요","Waiting for other windows to connect":"다른 창이 연결하기를 기다리는 중","Waiting for port forwarding to be ready":"포트 전달이 준비될 때까지 기다리는 중","When first establishing a connection to the remote server, various resources must be installed from the internet. A program (either \"wget\" or \"curl\") is used to download these resources, but they are not installed on the remote server.  When this step fails, the extension attempts to use the local machine to download the resources and then upload them to the remote server.":"원격 서버에 처음 연결할 때 인터넷에서 다양한 리소스를 설치해야 합니다. 이러한 리소스를 다운로드하는 데는 'wget' 또는 'curl' 프로그램이 사용되는데, 해당 프로그램이 원격 서버에 설치되어 있지 않습니다.  이 단계가 실패하면 확장에서 로컬 컴퓨터를 사용하여 리소스를 다운로드한 다음 원격 서버에 업로드하려고 시도합니다.","Windows hosts are only supported on VS Code Insiders":"Windows 호스트는 VS Code 참가자에서만 지원됩니다.","Windows remotes do not support local bootstrap":"Windows 원격은 로컬 부트스트랩을 지원하지 않습니다","about SSH configuration files":"SSH 구성 파일 정보","bash not found":"Bash를 찾을 수 없습니다.","click on an issue to continue in Copilot Chat.":"Copilot 채팅에서 계속하려면 문제를 클릭하세요.","https://aka.ms/vscode-remote/faq/old-linux":"https://aka.ms/vscode-remote/faq/old-linux","specify a custom configuration file":"사용자 지정 구성 파일 지정","{0} Add New SSH Host...":"{0} 새 SSH 호스트 추가...","{1} is not a valid host to bind":"{1}은(는) 바인딩할 올바른 호스트가 아닙니다."}
