{"\"{0}\" has fingerprint \"{1}\".":"\"{0}\", \"{1}\" parmak izine sahip.","'{0}' will be executed on your local machine.":"'{0}' will be executed on your local machine.","A VS Code Server matching your local installation could not be downloaded from the internet.":"Yerel kurulumunuza uygun bir VS Code Sunucusu İnternetten indirilemedi.","A command required on the remote machine was not found":"Uzak makinede gerekli bir komut bulunamadı","Add the setting '{0}' to the server's '{1}' (or similar) configuration file":"Sunucunun '{1}' (veya benzer) yapılandırma dosyasına '{0}' ayarını ekleyin","After logging into Copilot Chat, return here to continue diagnosing your connection issue.":"Copilot Sohbeti'ne giriş yapın ve bağlantı sorunlarınızı tanılamaya devam etmek için buraya geri dönebilirsiniz.","Allow":"Allow","Allow and Don't Ask Again":"Allow and Don't Ask Again","An SSH installation couldn't be found":"SSH yüklemesi bulunamadı","An error occurred while parsing the local SSH configuration file":"Yerel SSH yapılandırma dosyası ayrıştırılırken bir hata oluştu","Analyzing your previous SSH session logs...":"Analyzing your previous SSH session logs...","Are you sure you want to continue connecting?":"Bağlanmaya devam etmek istediğinizden emin misiniz?","Are you sure you want to continue?":"Devam etmek istediğinizden emin misiniz?","Can't assign requested address":"İstenen adres atanamıyor","Cancel":"İptal","Change value of setting {0} to '{1}'":"{0} ayarının değerini '{1}' olarak değiştirin","Chat with {0}":"{0} ile sohbet edin","Check proxy settings on local machine":"Yerel makinedeki ara sunucu ayarlarını kontrol edin","Check the Remote - SSH log for output from the script (prefixed with {0})":"Check the Remote - SSH log for output from the script (prefixed with {0})","Checking VS Code Server status failed - please install either curl or wget on the remote.":"VS Code Server durumunu kontrol etme başarısız oldu - lütfen uzaktan kumandaya curl veya wget yükleyin.","Client-side server download failed":"İstemci tarafında sunucu indirilemedi","Close Remote":"Uzak’ı Kapat","Config file to save in":"İçine kaydedilecek yapılandırma dosyası","Configure SSH Hosts...":"SSH Konaklarını Yapılandır...","Connect":"Bağlan","Connect to VS Code Server - retry {0}":"VS Code Sunucusuna Bağlan - yeniden dene {0}","Connecting was canceled":"Bağlantı iptal edildi","Continue":"Devam","Copying VS Code Server to host with scp":"VS Code Sunucusu scp ile konağa kopyalanıyor","Could not establish connection to \"{0}\"":"\"{0}\" ile bağlantı kurulamadı","Could not establish connection to \"{0}\": {1}":"\"{0}\" ile bağlantı kurulamadı: {1}","Could not resolve hostname":"Ana bilgisayar adı çözülemedi","Delete the setting for this host to use the default path in the user home directory":"Kullanıcı ana dizinindeki varsayılan yolu kullanmak için bu ana bilgisayar ayarını silin","Detected Windows host, need to reconnect":"Windows konağı algılandı, yeniden bağlanmak gerekiyor","Diagnose with Copilot":"Copilot ile tanıla","Disable {0}":"Devre dışı bırak: {0}","Discuss Remote - SSH related topics and diagnose connection issues with Copilot.  Recent connection logs will be shared with Copilot as chat context.":"Uzaktan - SSH ile ilgili konuları tartışıp Copilot ile bağlantı sorunlarını tanılayın.  Son bağlantı günlükleri, copilot ile sohbet bağlamı olarak paylaşılacak.","Do not use variables, double quotes, or other non-path characters when setting {0}":"Ayarlama yaparken değişkenler, çift tırnaklar veya diğer yol için uygun olmayan karakterler kullanmayın {0}","Don't Show Again":"Bir Daha Gösterme","Download the correct VS Code that corresponds both to your local installation and the remote architecture":"Hem yerel kurulumunuza hem de uzak mimariye karşılık gelen doğru VS Code'u indirin","Downloading VS Code Server":"VS Code Sunucusu indiriliyor","Downloading VS Code Server failed - please install either curl or wget on the remote.":"VS Code Server indirilemedi - lütfen uzaktan kumandaya curl veya wget yükleyin.","Downloading VS Code Server failed. Please try again later.":"VS Code Server indirilemedi. Lütfen daha sonra yeniden deneyin.","Downloading VS Code Server locally":"VS Code Sunucusu yerel olarak indiriliyor","Downloading VS Code Server...":"VS Code Sunucusu indiriliyor...","ERROR: TCP port forwarding appears to be disabled on the remote host. Ensure that the sshd_config has `AllowTcpForwarding yes`. Contact your system administrator if needed.":"HATA: TCP bağlantı noktası iletme, uzak ana bilgisayarda devre dışı bırakılmış gibi görünüyor. sshd_config için `AllowTcpForwarding yes` komutunun ayarlandığından emin olun. Gerekirse lütfen sistem yöneticinize başvurun.","Edit custom SSH configuration file":"Özel SSH yapılandırma dosyasını düzenle","Edit setting {0} to an absolute path on the remote server":"{0} ayarını uzak sunucuda mutlak bir yola eşitleyin","Enable {0} to allow VS Code to download the required resources locally":"VS Code'un gerekli kaynakları yerel makinenize indirmesine izin vermek için {0} öğesini etkinleştirin","Enable {0} to allow VS Code to download the required resources via your local machine and then upload them to the remote server":"VS Code'un gerekli kaynakları yerel makineniz üzerinden indirmesine ve ardından bunları uzak sunucuya yüklemesine izin vermek için {0} öğesini etkinleştirin","Ensure '{0}' operates between local and remote machines":"'{0}' programının yerel ve uzak makineler arasında çalıştığından emin olun","Ensure curl/wget are on the remote system's '{0}'":"Uzak sistemin '{0}' dizininde curl/wget programlarının bulunduğundan emin olun","Ensure that the parent directory exists":"Üst dizinin var olduğundan emin olun","Ensure that the remote server has internet access and has access to the VS Code CDN":"Uzak sunucunun İnternet erişimi olduğundan ve VS Code CDN'ye erişimi olduğundan emin olun","Ensure that the remote server has internet access and that the network is not blocking the download":"Uzak sunucunun İnternet erişimi olduğundan ve ağın indirmeyi engellemediğinden emin olun","Ensure that the remote user has write permissions to the parent directory":"Uzak kullanıcının üst dizine yazma izinlerine sahip olduğundan emin olun","Ensure that the {0} setting correctly reflects the remote platform. Ensure no wildcard entry is being selected erroneously":"{0} ayarının uzak platformu doğru yansıttığından emin olun. Hiçbir joker karakter girdisinin yanlışlıkla seçilmediğinden emin olun","Ensure the provide path is an absolute path":"Girilen yolun mutlak bir yol olduğundan emin olun","Ensure the provided path is executable and the script exits successfully (exit code 0)":"Ensure the provided path is executable and the script exits successfully (exit code 0)","Ensure the remote machine is configured to receive incoming connections on the local network":"Uzak makinenin yerel ağdan gelen bağlantıları alacak şekilde yapılandırıldığından emin olun","Ensure there is sufficient free disk space on the remote machine":"Uzak makinede yeterli boş disk alanı olduğundan emin olun","Ensure this program is installed on the remote machine and accessible via the '{0}' environment variable":"Bu programın uzak makinede yüklü olduğundan ve '{0}' ortam değişkeni aracılığıyla erişilebilir olduğundan emin olun","Enter SSH Connection Command":"SSH Bağlantı Komutunu Girin","Enter passphrase for ssh key {0}":"SSH anahtarı {0} için parolayı girin","Enter password":"Parola girin","Enter password for {0}":"{0} için parola girin","Error establishing tunnel ({0}).":"Tünel oluşturulurken hata oluştu ({0}).","Execute pre-connection script?":"Execute pre-connection script?","Expected tarball at local path {0}":"{0} yerel yolda tarball programının bulunması bekleniyor","Failed to create the remote server's install directory":"Uzak sunucunun yükleme dizini oluşturulamadı","Failed to download VS Code Server ({0})":"({0}) VS Code Sunucusu yerel olarak indirilemedi","Failed to download VS Code Server locally":"VS Code Sunucusu yerel olarak indirilemedi","Failed to find a free local port: {0}":"Ücretsiz bir yerel bağlantı noktası bulunamadı: {0}","Failed to find a non-Windows SSH installed. Password prompts may not be displayed properly! Disable `remote.SSH.useLocalServer` if needed./{Locked=\"`remote.SSH.useLocalServer`\"}Do not translate `remote.SSH.useLocalServer`, it is a VS Code command.":"Yüklenmiş Windows olmayan SSH bulunamadı. Parola istemleri düzgün görüntülenmeyebilir! Gerekirse `remote.SSH.useLocalServer` ayarını devre dışı bırakın.","Failed to install the VS Code Server":"VS Code Server yüklenemedi","Failed to kill VS Code Server on {0}.":"VS Code Sunucusu {0} üzerinde sonlandırılamadı.","Help":"Yardım","Host added!":"Konak eklendi!","Hostname contains invalid characters":"Ana bilgisayar adı geçersiz karakterler içeriyor","If your remote server is behind a firewall, ask your IT department to allow access to the VS Code CDN":"Uzak sunucunuz bir güvenlik duvarının arkasındaysa, bilgi teknolojisi departmanınızdan VS Code CDN'sine erişim izni vermesini isteyin","If your remote server is behind a proxy, provide the proxy URL with setting '{0}' or '{1}'":"Uzak sunucunuz bir ara sunucunun arkasındaysa, ara sunucu URL'sini '{0}' veya '{1}' ayarıyla girin","Initializing VS Code Server":"VS Code Sunucusu başlatılıyor","Install '{0}' on the remote server. Installation steps will vary per distribution.":"Uzak sunucuya '{0}' programını yükleyin. Yükleme adımları dağıtıma göre değişiklik gösterir.","Installing VS Code Server":"VS Code Sunucusu yükleniyor","Killed VS Code Server on {0}.":"VS Code Sunucusu {0} üzerinde sonlandırıldı.","Learn More":"Daha Fazla Bilgi Edinin","Local bootstrap of the VS Code Server failed.  This is an advanced feature for use in environments with limited internet acccess.":"VS Code Sunucusunun yerel önyüklemesi başarısız oldu.  Bu, sınırlı internet erişimine sahip ortamlarda kullanılabilecek gelişmiş bir özelliktir.","Local download mode is configured as 'manual-bootstrap'. Exec server mode will be disabled.'":"Yerel indirme modu 'el ile önyükleme' olarak yapılandırıldı. Özel sunucu modu devre dışı bırakılacaktır.'","Max wait time exhausted":"En uzun bekleme süresi bitti","Message":"İleti","Mitigations":"Azaltıcı etken","More Actions...":"Diğer Eylemler...","More Info":"Daha Fazla Bilgi","Network is unreachable":"Ağa ulaşılamıyor","No free ports in specified range '{0}-{1}'.  Remove or update the 'Preferred Local Port Range' setting and try again.":"Belirtilen '{0}-{1}' aralığında boş bağlantı noktası bulunamadı.  ‘Tercih Edilen Yerel Bağlantı Noktası Aralığı’ ayarını kaldırın veya güncelleştirme ve yeniden deneyin.","No route found to remote machine with a local IPv4 address.":"Uzak makineye yerel IPv4 adresine sahip bir yol bulunamadı.","No route to host":"Konak yolu yok","On Mac OS, grant VS Code the 'Local Network' permission in System Settings":"Mac OS'ta, Sistem Ayarlarında VS Code'a 'Yerel Ağ' izni verin","Open Config":"Yapılandırmayı Aç","Open Documentation":"Belgeleri Aç","Open Logs":"Günlükleri Aç","Open Recent...":"Son Kullanılanları Aç...","Open SSH Configuration File":"SSH Yapılandırma Dosyasını Aç","Open Settings":"Ayarları Aç","Pick an action to help resolve the problem.":"Sorunu çözmeye yardımcı olmak için bir eylem seçin.","Place the VS Code Server in the bootstrap location specified in settings":"VS Code Sunucusunu ayarlarda belirtilen önyükleme konumuna koyun","Port forwarding is disabled":"Bağlantı noktası iletme devre dışı","Pre-connection script has changed since last confirmation":"Pre-connection script has changed since last confirmation","Proxy URL in settings is invalid":"Ayarlarındaki ara sunucu URL'si geçersiz","Received 407 from the server":"Sunucudan 407 alındı","Remote host key has changed, port forwarding is disabled":"Uzak ana bilgisayar anahtarı değişti, bağlantı noktası iletme devre dışı bırakıldı","Remove or edit setting {0}":"{0} ayarını kaldır veya bu ayarı düzenle","Remove this value from settings or correct the URL":"Bu değeri ayarlardan kaldırın veya URL'yi düzeltin","Report this issue with an example configuration file":"Bu sorunu örnek bir yapılandırma dosyasıyla bildirin","Resources":"Kaynaklar","Restart the SSH server on the remote machine to apply any changes to the configuration":"Yapılandırmada yapılan değişikliklerin uygulanması için uzak makinedeki SSH sunucusunu yeniden başlatın","Retry":"Yeniden dene","Running pre-connection script ({0})":"Running pre-connection script ({0})","SSH host name cannot begin with {0}":"SSH kullanıcı adı {0} ile başlayamaz.","SSH host name cannot include the character {0}":"SSH kullanıcı adı {0} karakterini içeremez","SSH user name cannot begin with {0}":"SSH kullanıcı adı {0} ile başlayamaz.","SSH user name cannot include the character {0}":"SSH kullanıcı adı {0} karakterini içeremez","Search '{0}' in settings":"Ayarlarda '{0}' öğesini arayın","See output log for server installation URL":"Sunucu yükleme URL'si için çıkış günlüğüne bakın","See verbose information in the":"Ayrıntılı bilgiler için bkz.","Select SSH configuration file to update":"Güncelleştirilen SSH yapılandırma dosyasını seçin","Select configured SSH host or enter user@host/Translate user@host such that both user and host are translated but joined by an \"@\" sign.":"Yapılandırılan SSH konağını seçin veya user@host girin","Set '{0}' in VS Code settings to use the correct proxy":"Doğru ara sunucuyu kullanmak için VS Code ayarlarında '{0}' öğesini ayarlayın","Setting up SSH Host {0}":"SSH Konağı {0} ayarlanıyor","Setting up SSH tunnel":"SSH tüneli ayarlanıyor","Settings":"Ayarlar","Show details in terminal":"Ayrıntıları terminalde göster","Skip":"Skip","Status":"Durum","The VS Code Server failed to start":"VS Code Sunucusu başlatılamadı","The VS Code Server terminated due to presence of CVE-2020-1416. Check the Remote-SSH output channel for more details.":"VS Code Server, CVE-2020-1416'nın varlığı nedeniyle sonlandırıldı. Daha fazla ayrıntı için Remote-SSH çıkış kanalını kontrol edin.","The connection timed out":"Bağlantı zaman aşımına uğradı","The following issues were detected in your most recent Remote - SSH session":"En son Uzaktan SSH oturumunuzda aşağıdaki sorunlar algılandı","The install directory on the remote host could not be created. By default this is the '{0}' directory and can be overridden with the setting {1}":"Uzak ana bilgisayarda yükleme dizini oluşturulamadı. Varsayılan olarak bu '{0}' dizinidir ve {1} ayarıyla geçersiz kılınabilir","The operation timed out":"İşlem zaman aşımına uğradı","The pre-connect script has failed":"The pre-connect script has failed","The process tried to write to a nonexistent pipe":"İşlem var olmayan bir boruya yazmaya çalıştı","The provided custom server path is invalid":"Girilen özel sunucu yolu geçersiz","The remote host does not meet the prerequisites for running VS Code Server":"Uzak ana bilgisayar, uzak sunucuyu çalıştırma önkoşullarını VS Code karşılamıyor","The remote host may not meet VS Code Server's prerequisites for glibc and libstdc++":"Uzak konak, VS Code Sunucusunun glibc ve libstdc++ önkoşullarını karşılamıyor olabilir","The remote host's architecture is not supported":"Uzak ana bilgisayarın mimarisi desteklenmiyor","The remote host's architecture is only supported on VS Code Insiders":"Uzak ana bilgisayarın mimarisi yalnızca VS Code Insiders’ta desteklenir","The remote host's platform is not supported":"Uzak ana bilgisayarın platformu desteklenmiyor","The remote server has terminated the connection due to a known and preventable security vulnerability":"Uzak sunucu, bilinen ve önlenebilir bir güvenlik açığı nedeniyle bağlantıyı sonlandırdı","The remote server's SSH configuration may have TCP forwarding disabled":"Uzak sunucunun SSH yapılandırmasında TCP iletimi devre dışı bırakılmış olabilir","URL must include the scheme ({0} or {1})":"URL, şemayı içermelidir ({0} veya {1})","URL should not contain non-URL characters":"URL, URL’e uygun olmayan karakterler içeremez","Unsupported script type. Provide a .ps1 script on Windows.":"Unsupported script type. Provide a .ps1 script on Windows.","Update VS Code and try again later":"VS Code'u güncelleştirin ve daha sonra tekrar deneyin","Update the remote.SSH.preconnect setting":"Update the remote.SSH.preconnect setting","View the Output Log to see mitigation steps provided by the VS Code Server":"VS Code Sunucusu tarafından sağlanan risk azaltma adımlarını görmek için Çıkış Günlüğünü görüntüleyin","Waiting for other windows to connect":"Diğer pencerelerin bağlanması bekleniyor","Waiting for port forwarding to be ready":"Bağlantı noktası iletmenin hazır olması bekleniyor","When first establishing a connection to the remote server, various resources must be installed from the internet. A program (either \"wget\" or \"curl\") is used to download these resources, but they are not installed on the remote server.  When this step fails, the extension attempts to use the local machine to download the resources and then upload them to the remote server.":"Uzak sunucuyla ilk bağlantı kurulurken, çeşitli kaynakların İnternetten yüklenmesi gereklidir. Bu kaynakları indirmek için bir program (\"wget\" veya \"curl\" gibi) kullanılır, ancak bu programlar uzak sunucuda yüklü değildir.  Bu adım başarısız olduğunda uzantı, kaynakları indirmek ve ardından bunları uzak sunucuya yüklemek için yerel makineyi kullanmaya çalışacaktır.","Windows hosts are only supported on VS Code Insiders":"Windows ana bilgisayarları yalnızca VS Code Insiders’ta desteklenir","Windows remotes do not support local bootstrap":"Windows uzak sunucuları yerel önyüklemeyi desteklemez","about SSH configuration files":"SSH yapılandırma dosyaları hakkında","bash not found":"bash bulunamadı","click on an issue to continue in Copilot Chat.":"Copilot Sohbeti'nde devam etmek için bir soruna tıklayın.","https://aka.ms/vscode-remote/faq/old-linux":"https://aka.ms/vscode-remote/faq/old-linux","specify a custom configuration file":"özel bir yapılandırma dosyası belirtin","{0} Add New SSH Host...":"{0} Yeni SSH Konağı Ekle","{1} is not a valid host to bind":"{1} bağlamak için geçerli bir konak değil"}
