{"\"{0}\" has fingerprint \"{1}\".":"\"{0}\" tiene la huella digital \"{1}\".","'{0}' will be executed on your local machine.":"'{0}' will be executed on your local machine.","A VS Code Server matching your local installation could not be downloaded from the internet.":"No se pudo descargar de Internet un servidor de VS Code que coincida con la instalación local.","A command required on the remote machine was not found":"No se encontró un comando necesario en el equipo remoto","Add the setting '{0}' to the server's '{1}' (or similar) configuration file":"Agregue el valor '{0}' al archivo de configuración '{1}' del servidor ' (o similar)","After logging into Copilot Chat, return here to continue diagnosing your connection issue.":"Después de iniciar sesión en Copilot Chat, vuelva aquí para seguir diagnosticando el problema de conexión.","Allow":"Permitir","Allow and Don't Ask Again":"Allow and Don't Ask Again","An SSH installation couldn't be found":"No se pudo encontrar una instalación SSH","An error occurred while parsing the local SSH configuration file":"Error al analizar el archivo de configuración de SSH local","Analyzing your previous SSH session logs...":"Analyzing your previous SSH session logs...","Are you sure you want to continue connecting?":"¿Está seguro de que quiere continuar con la conexión?","Are you sure you want to continue?":"¿Está seguro de que desea continuar?","Can't assign requested address":"No se puede asignar la dirección solicitada","Cancel":"Cancelar","Change value of setting {0} to '{1}'":"Cambiar el valor de la configuración {0} a '{1}'","Chat with {0}":"Chatear con {0}","Check proxy settings on local machine":"Comprobación de la configuración de proxy en el equipo local","Check the Remote - SSH log for output from the script (prefixed with {0})":"Check the Remote - SSH log for output from the script (prefixed with {0})","Checking VS Code Server status failed - please install either curl or wget on the remote.":"Error al comprobar el estado de VS Code Server. Instale curl o wget en el remoto.","Client-side server download failed":"Error en la descarga del servidor del lado cliente","Close Remote":"Cerrar remoto","Config file to save in":"Archivo de configuración en el que guardar","Configure SSH Hosts...":"Configurar hosts SSH...","Connect":"Conectar","Connect to VS Code Server - retry {0}":"Conectar a VS Code Server: vuelva a intentar {0}","Connecting was canceled":"Conexión cancelada","Continue":"Continuar","Copying VS Code Server to host with scp":"Copiando VS Code Server en el host con SCP","Could not establish connection to \"{0}\"":"No se pudo establecer la conexión con \"{0}\"","Could not establish connection to \"{0}\": {1}":"No se pudo establecer la conexión con \"{0}\": {1}","Could not resolve hostname":"No se pudo resolver el nombre de host","Delete the setting for this host to use the default path in the user home directory":"Elimine la configuración de este host para usar la ruta de acceso predeterminada en el directorio principal del usuario","Detected Windows host, need to reconnect":"Se detectó el host de Windows, es necesario volver a conectar","Diagnose with Copilot":"Diagnosticar con Copilot","Disable {0}":"Deshabilitar {0}","Discuss Remote - SSH related topics and diagnose connection issues with Copilot.  Recent connection logs will be shared with Copilot as chat context.":"Discutir temas remotos relacionados con SSH y diagnosticar problemas de conexión con Copilot.  Los registros de conexión recientes se compartirán con Copilot como contexto de chat.","Do not use variables, double quotes, or other non-path characters when setting {0}":"No use variables, comillas dobles u otros caracteres que no sean de ruta de acceso al establecer {0}","Don't Show Again":"No volver a mostrar","Download the correct VS Code that corresponds both to your local installation and the remote architecture":"Descargue la versión correcta de VS Code que corresponda tanto a su instalación local como a la arquitectura remota","Downloading VS Code Server":"Descargando el servidor VS Code ","Downloading VS Code Server failed - please install either curl or wget on the remote.":"Error al descargar VS Code Server: instale curl o wget en el remoto.","Downloading VS Code Server failed. Please try again later.":"Error al descargar VS Code Server. Vuelva a intentarlo más tarde.","Downloading VS Code Server locally":"Descargando VS Code Server localmente","Downloading VS Code Server...":"Descargando el servidor VS Code...","ERROR: TCP port forwarding appears to be disabled on the remote host. Ensure that the sshd_config has `AllowTcpForwarding yes`. Contact your system administrator if needed.":"ERROR: parece que el reenvío de puertos TCP está deshabilitado en el host remoto. Asegúrese de que sshd_config tenga 'AllowTcpForwarding yes'. Póngase en contacto con el administrador del sistema si es necesario.","Edit custom SSH configuration file":"Editar archivo de configuración SSH personalizado","Edit setting {0} to an absolute path on the remote server":"Editar la configuración {0} a una ruta de acceso absoluta en el servidor remoto","Enable {0} to allow VS Code to download the required resources locally":"Habilitar {0} para permitir que VS Code descarguen los recursos necesarios localmente","Enable {0} to allow VS Code to download the required resources via your local machine and then upload them to the remote server":"Habilite {0} para permitir que VS Code descarguen los recursos necesarios a través de la máquina local y, a continuación, cárguelos en el servidor remoto","Ensure '{0}' operates between local and remote machines":"Asegúrese de que '{0}' funciona entre máquinas locales y remotas","Ensure curl/wget are on the remote system's '{0}'":"Asegúrese de que curl/wget se encuentran en el sistema remoto '{0}' ","Ensure that the parent directory exists":"Asegúrese de que el directorio primario existe","Ensure that the remote server has internet access and has access to the VS Code CDN":"Asegúrese de que el servidor remoto tiene acceso a Internet y tiene acceso a la red CDN VS Code","Ensure that the remote server has internet access and that the network is not blocking the download":"Asegúrese de que el servidor remoto tiene acceso a Internet y de que la red no está bloqueando la descarga","Ensure that the remote user has write permissions to the parent directory":"Asegúrese de que el usuario remoto tiene permisos de escritura en el directorio primario","Ensure that the {0} setting correctly reflects the remote platform. Ensure no wildcard entry is being selected erroneously":"Asegúrese de que la configuración {0} refleje correctamente la plataforma remota. Asegúrese de que no se selecciona por error ninguna entrada con caracteres comodín","Ensure the provide path is an absolute path":"Asegúrese de que la ruta de acceso de proporcionar es una ruta de acceso absoluta","Ensure the provided path is executable and the script exits successfully (exit code 0)":"Ensure the provided path is executable and the script exits successfully (exit code 0)","Ensure the remote machine is configured to receive incoming connections on the local network":"Asegúrese de que la máquina remota está configurada para recibir conexiones entrantes en la red local","Ensure there is sufficient free disk space on the remote machine":"Asegúrese de que hay suficiente espacio libre en disco en el equipo remoto","Ensure this program is installed on the remote machine and accessible via the '{0}' environment variable":"Asegúrese de que este programa está instalado en el equipo remoto y es accesible a través de la variable de entorno '{0}'","Enter SSH Connection Command":"Escriba el comando de conexión SSH","Enter passphrase for ssh key {0}":"Escriba la frase de contraseña para la clave SSH {0}","Enter password":"Escribir contraseña","Enter password for {0}":"Escribir contraseña para {0}","Error establishing tunnel ({0}).":"Error al establecer el túnel ({0}).","Execute pre-connection script?":"Execute pre-connection script?","Expected tarball at local path {0}":"Se esperaba tarball en la ruta de acceso local {0}","Failed to create the remote server's install directory":"No se pudo crear el directorio de instalación del servidor remoto","Failed to download VS Code Server ({0})":"No se ha podido descargar VS Code Server ({0})","Failed to download VS Code Server locally":"No se pudo descargar VS Code Server localmente","Failed to find a free local port: {0}":"No se pudo encontrar un puerto local libre: {0}","Failed to find a non-Windows SSH installed. Password prompts may not be displayed properly! Disable `remote.SSH.useLocalServer` if needed./{Locked=\"`remote.SSH.useLocalServer`\"}Do not translate `remote.SSH.useLocalServer`, it is a VS Code command.":"No se encontró ningún SSH instalado que no fuera de Windows. Es posible que las solicitudes de contraseña no se muestren correctamente. Deshabilite `remote.SSH.useLocalServer` si es necesario.","Failed to install the VS Code Server":"No se pudo instalar VS Code Server","Failed to kill VS Code Server on {0}.":"No se pudo terminar VS Code Server en {0}.","Help":"Ayuda","Host added!":"Se ha agregado el host.","Hostname contains invalid characters":"El nombre de host contiene caracteres no válidos","If your remote server is behind a firewall, ask your IT department to allow access to the VS Code CDN":"Si el servidor remoto está detrás de un firewall, pida al departamento de TI que permita el acceso a la red CDN VS Code","If your remote server is behind a proxy, provide the proxy URL with setting '{0}' or '{1}'":"Si el servidor remoto está detrás de un proxy, proporcione la dirección URL del proxy con el valor '{0}' o '{1}'","Initializing VS Code Server":"Inicializando VS Code Server","Install '{0}' on the remote server. Installation steps will vary per distribution.":"Instale '{0}' en el servidor remoto. Los pasos de instalación variarán según la distribución.","Installing VS Code Server":"Instalación del servidor VS Code","Killed VS Code Server on {0}.":"Se eliminó VS Code Server en {0}.","Learn More":"Más información","Local bootstrap of the VS Code Server failed.  This is an advanced feature for use in environments with limited internet acccess.":"Error en el arranque local del servidor de VS Code.  Se trata de una característica avanzada para su uso en entornos con acceso limitado a Internet.","Local download mode is configured as 'manual-bootstrap'. Exec server mode will be disabled.'":"El modo de descarga local está configurado como \"manual-bootstrap\". Se deshabilitará el modo de servidor Exec.","Max wait time exhausted":"Tiempo de espera máximo agotado","Message":"Mensaje","Mitigations":"Mitigaciones","More Actions...":"Más acciones...","More Info":"Más información","Network is unreachable":"No se puede acceder a la red","No free ports in specified range '{0}-{1}'.  Remove or update the 'Preferred Local Port Range' setting and try again.":"No hay puertos libres en el intervalo especificado \"{0}-{1}\".  Quite o actualice el valor \"Intervalo de puertos locales preferido\" e inténtelo de nuevo.","No route found to remote machine with a local IPv4 address.":"No se encontró ninguna ruta al equipo remoto con una dirección IPv4 local.","No route to host":"No hay ninguna ruta al host","On Mac OS, grant VS Code the 'Local Network' permission in System Settings":"En Mac OS, conceda a VS Code el permiso \"Red local\" en Configuración del sistema","Open Config":"Abrir configuración","Open Documentation":"Abrir documentación","Open Logs":"Abrir registros","Open Recent...":"Abrir Recientes...","Open SSH Configuration File":"Abrir archivo de configuración SSH","Open Settings":"Abrir configuración","Pick an action to help resolve the problem.":"Elija una acción para ayudar a resolver el problema.","Place the VS Code Server in the bootstrap location specified in settings":"Coloque el servidor de VS Code en la ubicación de arranque especificada en la configuración","Port forwarding is disabled":"El reenvío de puertos está deshabilitado","Pre-connection script has changed since last confirmation":"Pre-connection script has changed since last confirmation","Proxy URL in settings is invalid":"La dirección URL del proxy en la configuración no es válida","Received 407 from the server":"Recibido 407 del servidor","Remote host key has changed, port forwarding is disabled":"La clave de host remoto ha cambiado, el reenvío de puertos está deshabilitado","Remove or edit setting {0}":"Quitar o editar la configuración {0}","Remove this value from settings or correct the URL":"Quitar este valor de la configuración o corregir la dirección URL","Report this issue with an example configuration file":"Notificar este problema con un archivo de configuración de ejemplo","Resources":"Recursos","Restart the SSH server on the remote machine to apply any changes to the configuration":"Reinicie el servidor SSH en el equipo remoto para aplicar cualquier cambio en la configuración","Retry":"Reintentar","Running pre-connection script ({0})":"Running pre-connection script ({0})","SSH host name cannot begin with {0}":"El nombre de host SSH no puede empezar por {0}","SSH host name cannot include the character {0}":"El nombre de host SSH no puede incluir el carácter {0}","SSH user name cannot begin with {0}":"El nombre de usuario SSH no puede empezar por {0}","SSH user name cannot include the character {0}":"El nombre de usuario SSH no puede incluir el carácter {0}","Search '{0}' in settings":"Buscar '{0}' en la configuración","See output log for server installation URL":"Consulte el registro de salida de la dirección URL de instalación del servidor","See verbose information in the":"Ver información detallada en el","Select SSH configuration file to update":"Seleccionar archivo de configuración SSH para actualizar","Select configured SSH host or enter user@host/Translate user@host such that both user and host are translated but joined by an \"@\" sign.":"Seleccione el host SSH configurado o escriba usuario@host","Set '{0}' in VS Code settings to use the correct proxy":"Establezca '{0}' en la configuración de VS Code para usar el proxy correcto","Setting up SSH Host {0}":"Configurando el {0} de host SSH","Setting up SSH tunnel":"Configurando el túnel SSH","Settings":"Configuración","Show details in terminal":"Mostrar detalles en el terminal","Skip":"Omitir","Status":"Estado","The VS Code Server failed to start":"No se pudo iniciar VS Code Server","The VS Code Server terminated due to presence of CVE-2020-1416. Check the Remote-SSH output channel for more details.":"VS Code Server finalizó debido a la presencia de CVE-2020-1416. Compruebe el canal de salida Remote-SSH para obtener más detalles.","The connection timed out":"La conexión ha agotado el tiempo de espera","The following issues were detected in your most recent Remote - SSH session":"Se detectaron los siguientes problemas en la sesión remota - SSH más reciente","The install directory on the remote host could not be created. By default this is the '{0}' directory and can be overridden with the setting {1}":"No se pudo crear el directorio de instalación en el host remoto. De forma predeterminada, este es el directorio '{0}' y se puede invalidar con la configuración {1}","The operation timed out":"Se agotó el tiempo de espera de la operación","The pre-connect script has failed":"The pre-connect script has failed","The process tried to write to a nonexistent pipe":"El proceso intentó escribir en una canalización inexistente","The provided custom server path is invalid":"La ruta de acceso del servidor personalizado proporcionada no es válida","The remote host does not meet the prerequisites for running VS Code Server":"El host remoto no cumple los requisitos previos para ejecutar VS Code Server","The remote host may not meet VS Code Server's prerequisites for glibc and libstdc++":"Es posible que el host remoto no cumpla los requisitos previos de VS Code Server para glibc y libstdc++","The remote host's architecture is not supported":"No se admite la arquitectura del host remoto","The remote host's architecture is only supported on VS Code Insiders":"La arquitectura del host remoto solo se admite en participantes de Insider de VS Code","The remote host's platform is not supported":"No se admite la plataforma del host remoto","The remote server has terminated the connection due to a known and preventable security vulnerability":"El servidor remoto ha terminado la conexión debido a una vulnerabilidad de seguridad conocida y evitable","The remote server's SSH configuration may have TCP forwarding disabled":"La configuración SSH del servidor remoto puede tener deshabilitado el reenvío TCP","URL must include the scheme ({0} or {1})":"La dirección URL debe incluir el esquema ({0} o {1})","URL should not contain non-URL characters":"La dirección URL no debe contener caracteres que no sean de dirección URL","Unsupported script type. Provide a .ps1 script on Windows.":"Unsupported script type. Provide a .ps1 script on Windows.","Update VS Code and try again later":"Actualice VS Code e inténtelo de nuevo más tarde","Update the remote.SSH.preconnect setting":"Update the remote.SSH.preconnect setting","View the Output Log to see mitigation steps provided by the VS Code Server":"Ver el Registro de salida para ver los pasos de mitigación proporcionados por el Servidor de VS Code","Waiting for other windows to connect":"Esperando a que otras ventanas se conecten","Waiting for port forwarding to be ready":"Esperando a que el reenvío de puertos esté listo","When first establishing a connection to the remote server, various resources must be installed from the internet. A program (either \"wget\" or \"curl\") is used to download these resources, but they are not installed on the remote server.  When this step fails, the extension attempts to use the local machine to download the resources and then upload them to the remote server.":"La primera vez que se establece una conexión con el servidor remoto, se deben instalar varios recursos desde Internet. Se usa un programa (\"wget\" o \"curl\") para descargar estos recursos, pero no están instalados en el servidor remoto.  Cuando se produce un error en este paso, la extensión intenta usar el equipo local para descargar los recursos y, a continuación, cargarlos en el servidor remoto.","Windows hosts are only supported on VS Code Insiders":"Los hosts de Windows solo se admiten en Insiders de VS Code","Windows remotes do not support local bootstrap":"Los remotos de Windows no admiten el arranque local","about SSH configuration files":"acerca de los archivos de configuración SSH","bash not found":"bash no encontrado","click on an issue to continue in Copilot Chat.":"haga clic en un problema para continuar en el chat de Copilot.","https://aka.ms/vscode-remote/faq/old-linux":"https://aka.ms/vscode-remote/faq/old-linux","specify a custom configuration file":"especificar un archivo de configuración personalizado","{0} Add New SSH Host...":"{0} Agregar nuevo host SSH...","{1} is not a valid host to bind":"{1} no es un host válido al que enlazarse"}
